<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>B.2. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="bugreports.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; B. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;"><link rel="previous" href="bugreports_fix.html" title="B.1. &#1050;&#1072;&#1082; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;"><link rel="next" href="bugreports_where.html" title="B.3. &#1050;&#1091;&#1076;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">B.2. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bugreports_fix.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; B. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;</th><td width="20%" align="right"> <a accesskey="n" href="bugreports_where.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="bugreports_report"></a>B.2. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;</h2></div></div><p>
&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1077;&#1081;&#1096;&#1091;&#1102; CVS &#1074;&#1077;&#1088;&#1089;&#1080;&#1102;
<span class="application">MPlayer</span>'&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1042;&#1072;&#1096;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1091;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072;. &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;
&#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1074; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1083;&#1080;&#1079;&#1072;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1085;&#1077;&#1081;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1088;&#1077;&#1083;&#1080;&#1079;&#1072;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;
&#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <span class="bold"><b>&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; CVS</b></span>. &#1069;&#1090;&#1086;
&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1080; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; <span class="application">MPlayer</span>'&#1072;. &#1042;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; CVS &#1074;&#1085;&#1080;&#1079;&#1091;
<a href="http://www.mplayerhq.hu/homepage/dload.html" target="_top">&#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>
&#1080;&#1083;&#1080; &#1074; README. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1075;&#1083;&#1086;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1087;&#1080;&#1089;&#1082;&#1091;
<a href="bugs.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; C. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;">&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</a> &#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080;
&#1042;&#1072;&#1096;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1072;&#1096;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081;,
&#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;.
</p><p>
&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1085;&#1077; &#1087;&#1088;&#1080;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1083;&#1080;&#1095;&#1085;&#1086; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091;.
&#1069;&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1072;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;, &#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1042;&#1072;&#1096;&#1080;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;. &#1044;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1091;&#1078;&#1077; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100;
&#1089; &#1042;&#1072;&#1096;&#1077;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1080; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1082;&#1086;&#1076;&#1077;
<span class="application">MPlayer</span>'&#1072;.
</p><p>
&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1042;&#1072;&#1096;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
&#1055;&#1088;&#1086;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1077; &#1088;&#1072;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;, &#1087;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;. &#1055;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1090;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093;?
&#1054;&#1085;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1090;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1083;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;? &#1055;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1083;&#1080; &#1101;&#1090;&#1086;
&#1089; &#1082;&#1072;&#1082;&#1080;&#1084;-&#1090;&#1086; &#1086;&#1076;&#1085;&#1080;&#1084; &#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1084;, &#1080;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1082;&#1086;&#1076;&#1077;&#1082;&#1072;? &#1052;&#1086;&#1078;&#1077;&#1090;&#1077; &#1083;&#1080; &#1042;&#1099;
&#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;? &#1063;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1042;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077;
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1077;&#1084; &#1074;&#1099;&#1096;&#1077; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;.
&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1085;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1072;&#1078;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1087;&#1088;&#1086;&#1089;&#1080;&#1084; &#1085;&#1080;&#1078;&#1077;,
&#1080;&#1085;&#1072;&#1095;&#1077; &#1084;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1084; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1076;&#1080;&#1072;&#1075;&#1085;&#1086;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1042;&#1072;&#1096;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;.
</p><p>
&#1042;&#1077;&#1083;&#1080;&#1082;&#1086;&#1083;&#1077;&#1087;&#1085;&#1086;&#1077;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1085;&#1080;&#1102; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;
&#1085;&#1072; &#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;&#1093; &#8212; &#1101;&#1090;&#1086; 
<a href="http://www.catb.org/~esr/faqs/smart-questions.html" target="_top">How To Ask
Questions The Smart Way[&#1050;&#1072;&#1082; &#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1042;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;. &#1055;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1055;&#1091;&#1090;&#1100;.]</a>,
&#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; <a href="http://www.catb.org/~esr/" target="_top">Eric S. Raymond</a>.
&#1045;&#1089;&#1090;&#1100; &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#8212;
<a href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html" target="_top">How to Report
Bugs Effectively[&#1050;&#1072;&#1082; &#1069;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1057;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1086;&#1073; &#1054;&#1096;&#1080;&#1073;&#1082;&#1077;]</a>, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; <a href="http://www.chiark.greenend.org.uk/~sgtatham/" target="_top">Simon Tatham</a>.
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103;&#1084;, &#1042;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;. &#1053;&#1086;,
&#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1091;&#1095;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;.
&#1052;&#1099; &#1086;&#1095;&#1077;&#1085;&#1100; &#1079;&#1072;&#1085;&#1103;&#1090;&#1099; &#1080; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1042;&#1072;&#1096;&#1077;&#1081;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; (&#1080;&#1083;&#1080; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1090;&#1074;&#1077;&#1090;).
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bugreports_fix.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="bugreports.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="bugreports_where.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">B.1. &#1050;&#1072;&#1082; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> B.3. &#1050;&#1091;&#1076;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;</td></tr></table></div></body></html>
