<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>B.5. &#1071; &#1079;&#1085;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1103; &#1076;&#1077;&#1083;&#1072;&#1102;...</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="bugreports.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; B. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;"><link rel="previous" href="bugreports_what.html" title="B.4. &#1063;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100;"><link rel="next" href="bugs.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; C. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">B.5. &#1071; &#1079;&#1085;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1103; &#1076;&#1077;&#1083;&#1072;&#1102;...</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bugreports_what.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; B. &#1050;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;</th><td width="20%" align="right"> <a accesskey="n" href="bugs.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="bugreports_advusers"></a>B.5. &#1071; &#1079;&#1085;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1103; &#1076;&#1077;&#1083;&#1072;&#1102;...</h2></div></div><p>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;, &#1080; &#1042;&#1099;
&#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; <span class="application">MPlayer</span>'&#1077;, &#1072; &#1085;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072; &#1080;&#1083;&#1080; &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;,
&#1042;&#1099; &#1091;&#1078;&#1077; &#1087;&#1088;&#1086;&#1095;&#1083;&#1080; &#1074;&#1089;&#1102; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1080; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1072;&#1096;&#1080; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1099;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;
&#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1091; mplayer-advusers &#1080; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1090;&#1100;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1090;&#1091;&#1076;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1095;&#1085;&#1099;&#1081; &#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;.
</p><p>
&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1086;&#1074; &#1080;&#1083;&#1080;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1042;&#1072;&#1089; &#1087;&#1088;&#1086;&#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;
&#1080;&#1083;&#1080; &#1086;&#1073;&#1088;&#1091;&#1075;&#1072;&#1102;&#1090; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090;&#1100;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1077; &#1079;&#1072;&#1074;&#1072;&#1083;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1089; &#1084;&#1077;&#1083;&#1086;&#1095;&#1072;&#1084;&#1080;
&#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; -advusers &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1042;&#1099;
&#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077;, &#1080; &#1086;&#1097;&#1091;&#1097;&#1072;&#1077;&#1090;&#1077; &#1089;&#1077;&#1073;&#1103; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084; <span class="application">MPlayer</span>'&#1072;.
&#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1087;&#1086;&#1076; &#1101;&#1090;&#1086;&#1090; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1081;, &#1042;&#1072;&#1084; &#1085;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1090;&#1088;&#1091;&#1076;&#1072; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1085;&#1072;&#1076;&#1086;
&#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;&#1089;&#1103;...
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bugreports_what.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="bugreports.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="bugs.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">B.4. &#1063;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; C. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</td></tr></table></div></body></html>
