<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>C.2. &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; A-V &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="bugs.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; C. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;"><link rel="previous" href="bugs-special.html" title="C.1. &#1054;&#1089;&#1086;&#1073;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;/CPU-&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;/&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;"><link rel="next" href="skin.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; D. MPlayer skin format"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">C.2. &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; A-V &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bugs-special.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; C. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</th><td width="20%" align="right"> <a accesskey="n" href="skin.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="bugs-audio"></a>C.2. &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; A-V &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</h2></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="bugs-delay-all"></a>C.2.1. &#1054;&#1073;&#1097;&#1072;&#1103; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1072;&#1091;&#1076;&#1080;&#1086; &#1080;&#1083;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1080;&#1089;&#1090;&#1099;&#1081; &#1079;&#1074;&#1091;&#1082; (&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1080;&#1083;&#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080;
&#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;)</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>
&#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1073;&#1097;&#1077;&#1077;: &#1087;&#1083;&#1086;&#1093;&#1080;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;! - &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;,
&#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; ALSA 0.9 OSS &#1101;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <tt class="option">-ao oss</tt>, &#1090;&#1072;&#1082;&#1078;&#1077;
&#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; <tt class="option">-ao sdl</tt>, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1072;&#1096; &#1092;&#1072;&#1081;&#1083; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;
&#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; <tt class="option">-nosound</tt>, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1073;&#1099;&#1090;&#1100; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;: &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;
&#1042;&#1072;&#1096;&#1077;&#1081; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1081; &#1082;&#1072;&#1088;&#1090;&#1099; (&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1074;).
</p></li></ul></div><div class="itemizedlist"><ul type="disc"><li><p>&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1072;&#1091;&#1076;&#1080;&#1086; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;)</p><p>&#1054;&#1073;&#1093;&#1086;&#1076;: &#1054;&#1087;&#1094;&#1080;&#1103; <span class="application">MPlayer</span>'&#1072; <tt class="option">-abs</tt></p></li></ul></div><div class="itemizedlist"><ul type="disc"><li><p>
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1089;&#1101;&#1084;&#1087;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; - &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1042;&#1072;&#1096;&#1072; &#1082;&#1072;&#1088;&#1090;&#1072; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1091;
&#1089;&#1101;&#1084;&#1087;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1091;&#1102; &#1074; &#1042;&#1072;&#1096;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; - &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1089;&#1101;&#1084;&#1087;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (<tt class="option">-af resample=...</tt>)
</p></li></ul></div><div class="itemizedlist"><ul type="disc"><li><p>&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1084;&#1072;&#1096;&#1080;&#1085;&#1072; (CPU &#1080;&#1083;&#1080; VGA)</p><p>&#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1089; <tt class="option">-vo null</tt>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;, &#1090;&#1086;
&#1091; &#1042;&#1072;&#1089; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; VGA &#1082;&#1072;&#1088;&#1090;&#1072;/&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;</p><p>&#1054;&#1073;&#1093;&#1086;&#1076;: &#1082;&#1091;&#1087;&#1080;&#1090;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1091; &#1080;&#1083;&#1080; &#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082;
&#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100;&#1089;&#1103;</p><p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; <tt class="option">-framedrop</tt></p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="bugs-delay-specific"></a>C.2.2. &#1040;&#1091;&#1076;&#1080;&#1086; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;/&#1076;&#1077;&#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;, &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093;
&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>&#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;</p><p>
&#1054;&#1073;&#1093;&#1086;&#1076;:
  </p><div class="itemizedlist"><ul type="round"><li><p>&#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-ni</tt> &#1080;&#1083;&#1080; <tt class="option">-nobps</tt> option (&#1076;&#1083;&#1103;
    &#1085;&#1077; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1087;&#1083;&#1086;&#1093;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;)</p><p>&#1080;/&#1080;&#1083;&#1080;</p></li><li><p><tt class="option">-mc 0</tt>(&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089; &#1087;&#1083;&#1086;&#1093;&#1086; &#1087;&#1088;&#1086;&#1089;&#1083;&#1086;&#1105;&#1085;&#1085;&#1099;&#1084; VBR
	&#1072;&#1091;&#1076;&#1080;&#1086;)</p><p>&#1080;/&#1080;&#1083;&#1080;</p></li><li><p><tt class="option">-delay</tt> &#1080;&#1083;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <span class="keycap"><b>+</b></span>/<span class="keycap"><b>-</b></span>
    &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;</p></li></ul></div><p>
&#1045;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1090;&#1086; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1079;&#1072;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1084; &#1092;&#1072;&#1081;&#1083;, &#1084;&#1099; &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084; (&#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1084;).
</p></li><li><p>&#1042;&#1072;&#1096;&#1072; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1072;&#1103; &#1082;&#1072;&#1088;&#1090;&#1072; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; 48&#1082;&#1043;&#1094; </p><p>&#1054;&#1073;&#1093;&#1086;&#1076;: &#1082;&#1091;&#1087;&#1080;&#1090;&#1077; &#1083;&#1091;&#1095;&#1096;&#1091;&#1102; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1091;... &#1080;&#1083;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; fps &#1085;&#1072;
10% (&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <tt class="option">-fps 27</tt> &#1076;&#1083;&#1103; 30fps &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074;), &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;
&#1087;&#1083;&#1072;&#1075;&#1080;&#1085; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1089;&#1101;&#1084;&#1087;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;(resample)</p></li><li><p>&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1084;&#1072;&#1096;&#1080;&#1085;&#1072; (&#1077;&#1089;&#1083;&#1080; A-V &#1085;&#1077; &#1086;&#1082;&#1086;&#1083;&#1086; 0, &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1072;
&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;)</p><p>&#1054;&#1073;&#1093;&#1086;&#1076;: <tt class="option">-framedrop</tt></p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="bugs-nosound"></a>C.2.3. &#1042;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077;&#1090; &#1079;&#1074;&#1091;&#1082;&#1072;</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>&#1042;&#1072;&#1096; &#1092;&#1072;&#1081;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1072;&#1091;&#1076;&#1080;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;</p><p>&#1087;&#1088;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086;</p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="bugs-nopicture"></a>C.2.4. &#1042;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1089;&#1077;&#1088;&#1086;&#1077;/&#1079;&#1077;&#1083;&#1105;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;)</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>&#1042;&#1072;&#1096; &#1092;&#1072;&#1081;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;</p><p>&#1087;&#1088;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086;</p></li><li><p>
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;&#1077;&#1082; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;
&#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-vc</tt> or <tt class="option">-vfm</tt>
</p></li><li><p>
&#1042;&#1099; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1072;&#1090;&#1100; DivX 3.x &#1092;&#1072;&#1081;&#1083;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; OpenDivX &#1076;&#1077;&#1082;&#1086;&#1076;&#1077;&#1088; &#1080;&#1083;&#1080; XviD
(<tt class="option">-vc odivx</tt>) - &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; DivX4Linux &#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1087;&#1083;&#1077;&#1077;&#1088;
</p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="bugs-video"></a>C.2.5. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;</h3></div></div><p>
&#1055;&#1077;&#1088;&#1074;&#1086;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;: &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-fs -vm</tt> &#1080; <tt class="option">-zoom</tt> - &#1101;&#1090;&#1086;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;, (&#1087;&#1086;&#1082;&#1072;) &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1089;&#1077;&#1084;&#1080; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;
&#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1090; x11 &#1080;&#1083;&#1080; dga.
</p><p><b>&#1052;&#1077;&#1088;&#1094;&#1072;&#1085;&#1080;&#1077; OSD/&#1089;&#1091;&#1073;&#1090;&#1080;&#1090;&#1088;&#1086;&#1074;. </b>
<div class="itemizedlist"><ul type="disc"><li><p>x11 &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;: &#1080;&#1079;&#1074;&#1080;&#1085;&#1080;&#1090;&#1077;, &#1086;&#1085; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;</p></li><li><p>xv &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">-double</tt></p></li></ul></div>
</p><p><b>&#1079;&#1077;&#1083;&#1105;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; mga_vid (<tt class="option">-vo mga</tt>
/ <tt class="option">-vo xmga</tt>). </b>
<div class="itemizedlist"><ul type="disc"><li><p>mga_vid &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; RAM &#1085;&#1072; &#1042;&#1072;&#1096;&#1077;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1072;&#1088;&#1090;&#1077;,
&#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">mga_ram_size</tt>
</p></li></ul></div>
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bugs-special.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="bugs.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="skin.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">C.1. &#1054;&#1089;&#1086;&#1073;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;/CPU-&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;/&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; D. MPlayer skin format</td></tr></table></div></body></html>
