<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>3.5. &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; [Edit Decision Lists] (EDL)</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="usage.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"><link rel="previous" href="mpst.html" title="3.4. &#1059;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080;"><link rel="next" href="faq.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 4. Frequently Asked Questions"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">3.5. &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; [Edit Decision Lists] (EDL)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="mpst.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="faq.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="edl"></a>3.5. &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; [Edit Decision Lists] (EDL)</h2></div></div><p>
&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; [edit decision list] (EDL) &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1042;&#1072;&#1084;
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1079;&#1072;&#1075;&#1083;&#1091;&#1096;&#1072;&#1090;&#1100; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100;
&#1085;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1086;&#1084; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1092;&#1080;&#1083;&#1100;&#1084;&#1072; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;.
</p><p>
&#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1093;&#1086;&#1090;&#1077;&#1090;&#1100; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1092;&#1080;&#1083;&#1100;&#1084; &#1074; "&#1089;&#1077;&#1084;&#1077;&#1081;&#1085;&#1086;&#1084;" &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;.
&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1077; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1089;&#1080;&#1083;&#1080;&#1103;, &#1085;&#1077;&#1085;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1083;&#1077;&#1082;&#1089;&#1080;&#1082;&#1080;,
Jar-Jar Binks, &#1080; &#1090;. &#1087;. &#1080;&#1079; &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074;, &#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1103;&#1089;&#1100; &#1089; &#1042;&#1072;&#1096;&#1080;&#1084;&#1080; &#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.
&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1099;
&#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074;.
</p><p>
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; EDL &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086;&#1082;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1077;&#1085;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; EDL &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1081;
&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; XML &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;
&#1092;&#1072;&#1081;&#1083;&#1086;&#1074; (&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1089; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1084;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1084;&#1080; EDL).
</p><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="edl_using"></a>3.5.1. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; EDL &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h3></div></div><p>
&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">-edl &lt;&#1080;&#1084;&#1103;_&#1092;&#1072;&#1081;&#1083;&#1072;&gt;</tt>, &#1082;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1077;
<span class="application">MPlayer</span>, &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; EDL &#1092;&#1072;&#1081;&#1083;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1074;&#1080;&#1076;&#1077;&#1086;.
</p></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="edl_making"></a>3.5.2. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; EDL &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h3></div></div><p>
&#1058;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; EDL:
<pre class="programlisting">
[&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;] [&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1072;&#1103; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;] [&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;]
</pre>
&#1043;&#1076;&#1077; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; - &#1101;&#1090;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1089; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; (&#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;), &#1072; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; -
&#1101;&#1090;&#1086; &#1080;&#1083;&#1080; <tt>0</tt> &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072; &#1080;&#1083;&#1080; <tt>1</tt> &#1076;&#1083;&#1103;
&#1079;&#1072;&#1075;&#1083;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<pre class="programlisting">
5.3   7.1    0
15    16.7   1
420   422    0
</pre>
&#1069;&#1090;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1090; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082; &#1074;&#1080;&#1076;&#1077;&#1086; &#1089; 5.3 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1076;&#1086; 7.1 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1075;&#1083;&#1091;&#1096;&#1080;&#1090; &#1079;&#1074;&#1091;&#1082;
&#1085;&#1072; 15 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1077;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1074; 16.7 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076; &#1080; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086; &#1089; 420 &#1087;&#1086; 422
&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;. &#1069;&#1090;&#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1090;&#1072;&#1081;&#1084;&#1077;&#1088; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077;&#1090;
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;.
</p><p>
&#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; EDL &#1092;&#1072;&#1081;&#1083;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">-edlout
&lt;filename&gt;</tt>. &#1055;&#1088;&#1080; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;
&#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1076;&#1074;&#1077; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="keycap"><b>i</b></span>.
&#1057;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1074; &#1092;&#1072;&#1081;&#1083;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1042;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1080; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; EDL &#1092;&#1072;&#1081;&#1083;.
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="mpst.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="usage.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="faq.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">3.4. &#1059;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1043;&#1083;&#1072;&#1074;&#1072; 4. Frequently Asked Questions</td></tr></table></div></body></html>
