<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>2.1. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="features.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;"><link rel="previous" href="features.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;"><link rel="next" href="codecs.html" title="2.2. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1082;&#1086;&#1076;&#1077;&#1082;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">2.1. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="features.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;</th><td width="20%" align="right"> <a accesskey="n" href="codecs.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="formats"></a>2.1. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;</h2></div></div><p>
&#1042;&#1072;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1086;&#1073;&#1097;&#1091;&#1102; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1083;&#1102;&#1076;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090; &#1092;&#1072;&#1081;&#1083; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084;
<tt class="filename">.AVI</tt>, &#1086;&#1085;&#1080; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; - &#1085;&#1077; MPEG &#1092;&#1072;&#1081;&#1083;.
&#1069;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;. &#1042;&#1086; &#1074;&#1089;&#1103;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;. &#1057;&#1091;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;
&#1090;&#1072;&#1082;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; <span class="emphasis"><i>&#1084;&#1086;&#1078;&#1077;&#1090;</i></span> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; MPEG &#1074;&#1080;&#1076;&#1077;&#1086;.
</p><p>
&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, <span class="bold"><b>&#1082;&#1086;&#1076;&#1077;&#1082;</b></span> &#8212; &#1101;&#1090;&#1086; &#1085;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;,
&#1095;&#1090;&#1086; &#1080; <span class="bold"><b>&#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072;</b></span>.
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1074;&#1080;&#1076;&#1077;&#1086; <span class="bold"><b>&#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1074;</b></span>: MPEG1, MPEG2, DivX, Indeo5, 3ivx.
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1074;&#1080;&#1076;&#1077;&#1086; <span class="bold"><b>&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074;</b></span>: MPG, AVI, ASF.
</p><p>
&#1042; &#1090;&#1077;&#1086;&#1088;&#1080;&#1080;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; OpenDivX &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; MP3 &#1072;&#1091;&#1076;&#1080;&#1086; 
&#1074; <span class="bold"><b>&#1092;&#1072;&#1081;&#1083; MPG &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;</b></span>. &#1061;&#1086;&#1090;&#1103;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;
&#1087;&#1083;&#1077;&#1077;&#1088;&#1086;&#1074; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1091;&#1090; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1090; MPEG1 &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; 
MP2 &#1072;&#1091;&#1076;&#1080;&#1086; (&#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; 
<span class="bold"><b>AVI</b></span>, &#1074; <span class="bold"><b>MPG</b></span>
&#1085;&#1077;&#1090; &#1085;&#1091;&#1078;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081; &#1076;&#1083;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;).
&#1048;&#1083;&#1080; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; MPEG1 &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; AVI &#1092;&#1072;&#1081;&#1083;.
<a href="http://ffmpeg.sourceforge.net/" target="_top">FFmpeg</a> &#1080;
<a href="mencoder.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 7. Encoding with MEncoder"><span class="application">MEncoder</span></a> &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099;.
</p><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="video-formats"></a>2.1.1. &#1042;&#1080;&#1076;&#1077;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;</h3></div></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="mpg-vob-dat"></a>2.1.1.1. MPEG &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
MPEG &#1092;&#1072;&#1081;&#1083;&#1099; &#1073;&#1099;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1085;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;:
</p><div class="itemizedlist"><ul type="disc"><li>
  MPG: &#1069;&#1090;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; <span class="bold"><b>&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103;</b></span> &#1092;&#1086;&#1088;&#1084;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
  &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; MPEG. &#1054;&#1085;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; MPEG1 &#1074;&#1080;&#1076;&#1077;&#1086;, &#1080; MP2 (MPEG-1 layer 2) &#1080;&#1083;&#1080; &#1088;&#1077;&#1078;&#1077;
  MP1 &#1072;&#1091;&#1076;&#1080;&#1086;.
  </li><li>
  DAT: &#1069;&#1090;&#1086; &#1087;&#1086;&#1095;&#1090;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1082;&#1072;&#1082; MPG, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1054;&#1085;
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; <span class="bold"><b>Video CD</b></span>. &#1048;&#1079;-&#1079;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;,
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; VCD &#1080; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; Linux'&#1072;, DAT &#1092;&#1072;&#1081;&#1083;&#1099; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;
  &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; VCD, &#1082;&#1072;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; Video CD &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <tt class="option">vcd://</tt>.
  </li><li>
  VOB: &#1069;&#1090;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; MPEG &#1092;&#1072;&#1083;&#1086;&#1074; &#1085;&#1072; <span class="bold"><b>DVD'&#1096;&#1085;&#1080;&#1082;&#1072;&#1093;</b></span>.
  &#1069;&#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1081; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1082;&#1072;&#1082; &#1080; MPG, &#1087;&#1083;&#1102;&#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1091;&#1073;&#1090;&#1080;&#1090;&#1088;&#1099; &#1080;
  &#1085;&#1077;-MPEG (AC3) &#1072;&#1091;&#1076;&#1080;&#1086;. &#1054;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; MPEG2 &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; AC3
  &#1072;&#1091;&#1076;&#1080;&#1086;, &#1085;&#1086; DTS, MP2 &#1080; &#1085;&#1077; &#1079;&#1072;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; LPCM &#1090;&#1086;&#1078;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;. <span class="bold"><b>
  &#1063;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1089;&#1077;&#1082;&#1094;&#1080;&#1102; <a href="dvd.html" title="5.2. &#1042;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; DVD">DVD</a></b></span>!
  </li></ul></div><p>
&#1057;&#1077;&#1088;&#1080;&#1080; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; MPEG &#1092;&#1072;&#1081;&#1083;&#1072;&#1093;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100; MPEG &#1092;&#1072;&#1083;&#1099; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1084;&#1080; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; (&#1090;&#1072;&#1082;&#1080;&#1084;&#1080;, &#1082;&#1072;&#1082;
<b>dd</b>, <b>cut</b>), &#1080; &#1086;&#1085; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;.
</p><p>
&#1054;&#1076;&#1085;&#1086; &#1080;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074; MPG'&#1086;&#1074; &#1101;&#1090;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1080;&#1093; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;,
&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1074;&#1080;&#1076;&#1077;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072; SVCD &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103;
&#1074;&#1080;&#1076;&#1077;&#1086; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; 480x480, &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083; &#1077;&#1075;&#1086;(&#1087;&#1086;&#1083;&#1077;) &#1074; 4:3, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1101;&#1090;&#1086;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; 640x480. &#1042; AVI &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1073;&#1099;&#1090;&#1100; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1087;&#1088;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081;
<tt class="option">-aspect</tt>.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="avi"></a>2.1.1.2. AVI &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1081; Microsoft'&#1086;&#1084; <span class="bold"><b>AVI (Audio Video Interleaved
[&#1040;&#1091;&#1076;&#1080;&#1086; &#1042;&#1080;&#1076;&#1077;&#1086; '&#1057;&#1083;&#1086;&#1105;&#1085;&#1099;&#1077;'])</b></span> - &#1101;&#1090;&#1086; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1099;&#1081; &#1084;&#1085;&#1086;&#1075;&#1086;&#1094;&#1077;&#1083;&#1077;&#1074;&#1086;&#1081;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; DivX &#1080; DivX4 &#1074;&#1080;&#1076;&#1077;&#1086;.
&#1059; &#1085;&#1077;&#1075;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1086;&#1074; &#1080; &#1085;&#1077;&#1076;&#1086;&#1095;&#1105;&#1090;&#1086;&#1074; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1093;). &#1054;&#1085;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; 1 &#1074;&#1080;&#1076;&#1077;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082; &#1080; &#1086;&#1090; 0 &#1076;&#1086; 99 &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077;
2 &#1043;&#1073;, &#1093;&#1086;&#1090;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;<span class="bold"><b>OpenDML</b></span>,
&#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1097;&#1077;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; Microsoft &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1090;
&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1086;&#1074;&#1077;&#1090;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; ASF/WMV. &#1053;&#1080;&#1082;&#1086;&#1075;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1074;&#1086;&#1083;&#1085;&#1091;&#1077;&#1090;.
</p><p>
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1093;&#1072;&#1082;[hack], &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; AVI &#1092;&#1072;&#1081;&#1083;&#1072;&#1084; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; Ogg Vorbis &#1072;&#1091;&#1076;&#1080;&#1086;
&#1087;&#1086;&#1090;&#1086;&#1082;&#1080;, &#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1080;&#1093; &#1085;&#1077;&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;&#1080; &#1089;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084;&#1080; AVI.
<span class="application">MPlayer</span> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1077;&#1085;&#1086;, &#1085;&#1086; &#1079;&#1072;&#1090;&#1088;&#1091;&#1076;&#1085;&#1077;&#1085;&#1086; &#1087;&#1083;&#1086;&#1093;&#1086; &#1079;&#1072;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;
&#1089; &#1079;&#1072;&#1087;&#1091;&#1090;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080;. &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1101;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1091;
&#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1072;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; -
<span class="application">NanDub</span>.
</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3><p>
DV &#1082;&#1072;&#1084;&#1077;&#1088;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1089;&#1099;&#1088;&#1099;&#1077; DV &#1087;&#1086;&#1090;&#1086;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; DV &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;
&#1074; AVI &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1074;&#1091;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;. AVI'&#1096;&#1085;&#1080;&#1082;&#1080; &#1083;&#1080;&#1073;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;
&#1087;&#1086;&#1090;&#1086;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; <span class="application">MPlayer</span> &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;, &#1080;&#1083;&#1080;
&#1089;&#1099;&#1088;&#1086;&#1081; DV &#1087;&#1086;&#1090;&#1086;&#1082;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.
</p></div><p>
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; AVI &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;:
</p><div class="itemizedlist"><ul type="disc"><li>
  <span class="bold"><b>'&#1057;&#1083;&#1086;&#1105;&#1085;&#1099;&#1077;'[Interleaved]:</b></span> &#1040;&#1091;&#1076;&#1080;&#1086; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;
  &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; '&#1087;&#1077;&#1088;&#1077;&#1087;&#1083;&#1077;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103;'. &#1069;&#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1085;&#1086; &#1080;
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;. &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1077; AVI'&#1096;&#1085;&#1080;&#1082;&#1080;
  &#1089; &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;. <span class="application">MPlayer</span>
  &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1101;&#1090;&#1086; &#1082;&#1072;&#1082; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1090;&#1077;&#1088;&#1103;&#1077;&#1090; A/V &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;,
  &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1092;&#1072;&#1081;&#1083;&#1091;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082;
  &#1085;&#1077; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1077; (&#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; <tt class="option">-ni</tt>).
  </li><li>
  <span class="bold"><b>&#1053;&#1077; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1077;:</b></span> &#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1076;&#1105;&#1090; &#1074;&#1077;&#1089;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;,
  &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1077;&#1089;&#1100; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;. &#1069;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1092;&#1072;&#1081;&#1083;&#1091;,
  &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1089;&#1077;&#1090;&#1080; &#1080;&#1083;&#1080; &#1089; CD-ROM &#1079;&#1072;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;.
  </li></ul></div><p>
</p><p>
<span class="application">MPlayer</span> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1076;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103;
AVI &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;:
</p><div class="itemizedlist"><ul type="disc"><li>
  <span class="bold"><b>&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; bps[&#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1077;]:</b></span> &#1054;&#1085; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072;
  &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1077;/&#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1089;&#1101;&#1084;&#1087;&#1083;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086;/&#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;
  &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1083;&#1077;&#1077;&#1088;&#1086;&#1074;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103;
  <a href="http://avifile.sourceforge.net" target="_top">avifile</a> &#1080;
  <span class="application">Windows Media Player</span>. &#1060;&#1072;&#1081;&#1083;&#1099; &#1089;&#1086; &#1089;&#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;
  &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080; &#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; VBR &#1072;&#1091;&#1076;&#1080;&#1086; &#1074; &#1085;&#1077; VBR-&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1077;
  &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1091;&#1090; &#1082; A/V &#1076;&#1077;&#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; (&#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081;
  &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1092;&#1080;&#1083;&#1100;&#1084;&#1091;).
  </li><li>
  <span class="bold"><b>&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1089;&#1083;&#1086;&#1105;&#1085;&#1086;&#1089;&#1090;&#1080;:</b></span> &#1054;&#1085; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
  &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1080;&#1079; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;, &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;
  &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1089;&#1083;&#1086;&#1105;&#1085;&#1099;&#1093; &#1082;&#1091;&#1089;&#1082;&#1086;&#1074; &#1072;&#1091;&#1076;&#1080;&#1086; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1087;&#1083;&#1086;&#1093;&#1086; &#1079;&#1072;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;
  &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1089; VBR &#1072;&#1091;&#1076;&#1080;&#1086;.
  </li></ul></div><p>
</p><p>
&#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099; &#1083;&#1102;&#1073;&#1099;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;&#1080;, &#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; VBR &#1072;&#1091;&#1076;&#1080;&#1086; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100;
&#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1083;&#1077;&#1077;&#1088;&#1086;&#1074;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; VBR &#1072;&#1091;&#1076;&#1080;&#1086;, &#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1083;&#1077;&#1077;&#1088;&#1099; &#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1090; CBR, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;&#1080;
&#1074;&#1099;&#1093;&#1086;&#1076;&#1103;&#1090; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1103; &#1089; VBR. VBR &#1088;&#1077;&#1076;&#1082;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; Microsoft'&#1086;&#1074;&#1089;&#1082;&#1080;&#1077; AVI
&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; CBR &#1072;&#1091;&#1076;&#1080;&#1086;. &#1071; &#1090;&#1072;&#1082;&#1078;&#1077; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;
&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1086;&#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1087;&#1083;&#1086;&#1093;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; VBR &#1072;&#1091;&#1076;&#1080;&#1086;. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;: <span class="application">NanDub</span> &#1080;
<a href="mencoder.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 7. Encoding with MEncoder"><span class="application">MEncoder</span></a>.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="asf-wmv"></a>2.1.1.3. ASF/WMV &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
ASF (Active Streaming Format) &#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1090; Microsoft. &#1054;&#1085;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1076;&#1074;&#1072; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;
ASF, v1.0 &#1080; v2.0. v1.0 &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1093; &#1084;&#1077;&#1076;&#1080;&#1072; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; (<span class="application">Windows
Media Player</span> &#1080; <span class="application">Windows Media Encoder</span>)
&#1080; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1089;&#1077;&#1082;&#1088;&#1077;&#1095;&#1077;&#1085;&#1099;. v2.0 &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1072; &#1080; &#1079;&#1072;&#1087;&#1072;&#1090;&#1077;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072; :). &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1086;&#1085;&#1080;
&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1087;&#1088;&#1072;&#1074;&#1086;&#1074;&#1072;&#1103; &#1080;&#1075;&#1088;&#1072;).
<span class="application">MPlayer</span> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; v1.0, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1080;&#1082;&#1090;&#1086;
&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1080;&#1076;&#1077;&#1083; v2.0 &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; :). &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; ASF &#1092;&#1072;&#1081;&#1083;&#1099; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
&#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; <tt class="filename">.WMA</tt> &#1080;&#1083;&#1080; <tt class="filename">.WMV</tt>.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="qt-mov"></a>2.1.1.4. QuickTime/MOV &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
&#1069;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1073;&#1099;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099; &#1074; Apple &#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1081; &#1082;&#1086;&#1076;&#1077;&#1082;,
CBR &#1080;&#1083;&#1080; VBR. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1091; &#1085;&#1080;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; <tt class="filename">.QT</tt> &#1080;&#1083;&#1080;
<tt class="filename">.MOV</tt>. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; MPEG4 &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083;&#1072;
QuickTime &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1076;&#1083;&#1103; MPEG4, &#1080;&#1079; MOV &#1092;&#1072;&#1081;&#1083;&#1099;
&#1080;&#1076;&#1091;&#1090; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; <tt class="filename">.MPG</tt> &#1080;&#1083;&#1080; <tt class="filename">.MP4</tt>
(&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1074; &#1101;&#1090;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; - &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077;
MPG &#1080; AAC &#1092;&#1072;&#1081;&#1083;&#1099;. &#1042;&#1099; &#1076;&#1072;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1080;&#1093;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1094;&#1080;&#1080;
<tt class="option">-dumpvideo</tt> &#1080; <tt class="option">-dumpaudio</tt>.).
</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3><p>
&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1085;&#1086;&#1074;&#1099;&#1093; QuickTime &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
<span class="bold"><b>Sorenson</b></span> &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; QDesign Music &#1072;&#1091;&#1076;&#1080;&#1086;. &#1057;&#1084;.
&#1089;&#1077;&#1082;&#1094;&#1080;&#1102;, &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1105;&#1085;&#1085;&#1091;&#1102; <a href="codecs.html#sorenson" title="2.2.1.9. Sorenson">Sorenson</a> &#1082;&#1086;&#1076;&#1077;&#1082;&#1091;.
</p></div></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="vivo"></a>2.1.1.5. VIVO &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<span class="application">MPlayer</span> &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1076;&#1077;&#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1087;&#1083;&#1077;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; VIVO &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;
&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1054;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1081; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1077;&#1084; &#1085;&#1077;&#1090;
&#1085;&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1085;&#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1073;&#1072;&#1081;&#1090;&#1086;&#1074; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;
&#1080; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1077;&#1090; &#1076;&#1072;&#1078;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1093; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;[keyframes], &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077;
&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1092;&#1072;&#1081;&#1083;&#1091;!
</p><p>
&#1042;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082; &#1074; VIVO/1.0 &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; - &#1101;&#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; <span class="bold"><b>h.263</b></span>.
&#1042;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082; &#1074; VIVO/2.0 &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; - &#1101;&#1090;&#1086; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;, &#1085;&#1077;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081;
<span class="bold"><b>h.263v2</b></span>. &#1040;&#1091;&#1076;&#1080;&#1086; &#1074; &#1086;&#1073;&#1086;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;&#1077;, &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
<span class="bold"><b>g.723 (&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;)</b></span>, &#1080;&#1083;&#1080;
<span class="bold"><b>Vivo Siren</b></span>.
</p><p>
&#1057;&#1084;. &#1089;&#1077;&#1082;&#1094;&#1080;&#1080;
<a href="codecs.html#vivo-video" title="2.2.1.4. VIVO &#1074;&#1080;&#1076;&#1077;&#1086;">VIVO &#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;</a> &#1080;
<a href="codecs.html#vivo-audio" title="2.2.2.4. VIVO &#1072;&#1091;&#1076;&#1080;&#1086;">VIVO &#1072;&#1091;&#1076;&#1080;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;</a>
&#1076;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081; &#1087;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="fli"></a>2.1.1.6. FLI &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<span class="bold"><b>FLI</b></span> &#1101;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1090;&#1072;&#1088;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081;
Autodesk Animator, &#1085;&#1086; &#1101;&#1090;&#1086; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1083;&#1103; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074; &#1089;&#1077;&#1090;&#1080;.
<span class="application">MPlayer</span> &#1076;&#1077;&#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1087;&#1083;&#1077;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1090; FLI &#1092;&#1080;&#1083;&#1100;&#1084;&#1099;
&#1080; &#1076;&#1072;&#1078;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1101;&#1090;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; (&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1087;&#1088;&#1080; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;
&#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; <tt class="option">-loop</tt>). &#1042;&#1086; FLI &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1085;&#1077;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;[keyframes],
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; "&#1075;&#1088;&#1103;&#1079;&#1085;&#1086;&#1081;".
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="realmedia"></a>2.1.1.7. RealMedia (RM) &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
&#1044;&#1072;, <span class="application">MPlayer</span> &#1084;&#1086;&#1078;&#1077;&#1090; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; (&#1076;&#1077;&#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1087;&#1083;&#1077;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;)
RealMedia (<tt class="filename">.rm</tt>) &#1092;&#1072;&#1081;&#1083;&#1099;. 
&#1047;&#1076;&#1077;&#1089;&#1100; &#1077;&#1089;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; <a href="codecs.html#realvideo" title="2.2.1.7. RealVideo">RealVideo</a> &#1080; <a href="codecs.html#realaudio" title="2.2.2.5. RealAudio">RealAudio</a> &#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1074;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="nuppelvideo"></a>2.1.1.8. NuppelVideo &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<a href="http://mars.tuwien.ac.at/~roman/nuppelvideo" target="_top">NuppelVideo</a> -
&#1101;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072; &#1089; &#1058;&#1042; (AFAIK:). <span class="application">MPlayer</span> &#1084;&#1086;&#1078;&#1077;&#1090;
&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; <tt class="filename">.NUV</tt> &#1092;&#1072;&#1081;&#1083;&#1099; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; NuppelVideo 5.0). &#1069;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099;
&#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1078;&#1072;&#1090;&#1099;&#1077; YV12, YV12+&#1089;&#1078;&#1072;&#1090;&#1099;&#1077; RTJpeg, YV12 &#1089;&#1078;&#1072;&#1090;&#1099;&#1077; RTJpeg+lzo &#1080;
YV12 + &#1089;&#1078;&#1072;&#1090;&#1099;&#1077; lzo &#1082;&#1072;&#1076;&#1088;&#1099;. <span class="application">MPlayer</span> &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1090; (&#1080; &#1090;&#1072;&#1082;&#1078;&#1077;
<span class="bold"><b>&#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1090;</b></span> &#1080;&#1093; <span class="application">MEncoder
</span>'&#1086;&#1084; &#1074; DivX/&#1080; &#1090;. &#1076;.!) &#1074;&#1089;&#1077; &#1101;&#1090;&#1086;. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="yuv4mpeg"></a>2.1.1.9. yuv4mpeg &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<a href="http://mjpeg.sourceforge.net" target="_top">yuv4mpeg / yuv4mpeg2</a>
&#1101;&#1090;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1074; 
<a href="http://mjpeg.sf.net" target="_top">&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; mjpegtools</a>.
&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1080;&#1079;&#1075;&#1086;&#1090;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1101;&#1090;&#1086;&#1090;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1101;&#1090;&#1080; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;. &#1042; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; -
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1078;&#1072;&#1090;&#1099;&#1093; YUV 4:2:0 &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="film"></a>2.1.1.10. FILM &#1092;&#1080;&#1083;&#1100;&#1084;&#1099;</h4></div></div><p>
&#1069;&#1090;&#1086;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; Sega Saturn CD-ROM &#1080;&#1075;&#1088;&#1072;&#1093;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="roq"></a>2.1.1.11. RoQ &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
RoQ &#1092;&#1072;&#1081;&#1083;&#1099; - &#1101;&#1090;&#1086; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; ID &#1080;&#1075;&#1088;&#1072;&#1093;,
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; Quake III &#1080; Return to Castle Wolfenstein.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="ogg"></a>2.1.1.12. OGG/OGM &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
&#1069;&#1090;&#1086; &#1085;&#1086;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1086;&#1090; <a href="http://www.xiph.org" target="_top">Xiphophorus</a>.
&#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080;&#1083;&#1080; &#1072;&#1091;&#1076;&#1080;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;, CBR &#1080;&#1083;&#1080; VBR. &#1042;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1103;&#1090;&#1089;&#1103;,
&#1095;&#1090;&#1086;&#1073;&#1099; <tt>libogg</tt> &#1080;
<tt>libvorbis</tt> &#1073;&#1099;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1076;&#1086; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; 
<span class="application">MPlayer</span>'&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099;  &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="sdp"></a>2.1.1.13. SDP &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<a href="ftp://ftp.rfc-editor.org/in-notes/rfc2327.txt" target="_top">SDP</a> - &#1101;&#1090;&#1086;
IETF &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1083;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; &#1072;&#1091;&#1076;&#1080;&#1086; RTP &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;.
(&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; "<a href="http://www.live.com/mplayer/" target="_top">LIVE.COM Streaming Media</a>".)
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="pva"></a>2.1.1.14. PVA &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
PVA - &#1101;&#1090;&#1086; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1081; &#1085;&#1072; MPEG &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; DVB TV &#1082;&#1072;&#1088;&#1090; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
<span class="application">MultiDec</span>, <span class="application">WinTV</span> &#1087;&#1086;&#1076; Windows.
</p><p>
&#1057;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; PVA &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1072;&#1095;&#1077;&#1085;&#1099; &#1087;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;:
<a href="http://www.technotrend.de/download/av_format_v1.pdf" target="_top">http://www.technotrend.de/download/av_format_v1.pdf</a>
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="nsv"></a>2.1.1.15. NSV files</h4></div></div><p>
NSV (NullSoft Video) &#8212; &#1101;&#1090;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081;
<span class="application">Winamp</span>'&#1086;&#1084; &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1091;&#1076;&#1080;&#1086; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;.
&#1042;&#1080;&#1076;&#1077;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; VP3, VP5 &#1080;&#1083;&#1080; VP6, &#1072; &#1072;&#1091;&#1076;&#1080;&#1086; &#8212; MP3, AAC &#1080;&#1083;&#1080; VLB.
&#1042;&#1077;&#1088;&#1089;&#1080;&#1080; NSV, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1091;&#1076;&#1080;&#1086;, &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; <tt class="filename">.nsa</tt>.
<span class="application">MPlayer</span> &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082;&#1072;&#1082; NSV &#1087;&#1086;&#1090;&#1086;&#1082;&#1080;,
&#1090;&#1072;&#1082; &#1080; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1079;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;
<a href="http://www.winamp.com" target="_top">&#1089;&#1072;&#1081;&#1090;&#1072; Winamp</a> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; VLB &#1072;&#1091;&#1076;&#1080;&#1086;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1077;&#1097;&#1105; &#1085;&#1077; &#1084;&#1086;&#1076;&#1077;&#1090; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1089; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1072;&#1081;&#1090;&#1072;
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1076;&#1077;&#1087;&#1072;&#1082;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1077;&#1097;&#1105; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; (&#1101;&#1090;&#1080;
&#1092;&#1072;&#1081;&#1083;&#1099; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; VLB &#1072;&#1091;&#1076;&#1080;&#1086;).
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="gif"></a>2.1.1.16. GIF &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
<span class="bold"><b>GIF</b></span> &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; - &#1101;&#1090;&#1086; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1083;&#1103; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1081;
&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; 2 &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081; GIF, GIF87a &#1080; GIF89a. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103;
&#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; GIF89a &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1102;. <span class="application">MPlayer</span> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;
&#1086;&#1073;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <tt>libungif</tt> &#1080;&#1083;&#1080;
&#1076;&#1088;&#1091;&#1075;&#1091;&#1102; libgif-&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1091;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091;. &#1053;&#1077; &#1072;&#1085;&#1080;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; GIF'&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1082;&#1072;&#1082; &#1086;&#1076;&#1085;&#1086;&#1082;&#1072;&#1076;&#1088;&#1086;&#1074;&#1086;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086;. (&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-loop</tt> &#1080;
<tt class="option">-fixed-vo</tt>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086;&#1076;&#1086;&#1083;&#1100;&#1096;&#1077;.)
</p><p>
&#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; <span class="application">MPlayer</span> &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; GIF &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1059; GIF &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;
&#1082;&#1072;&#1076;&#1088;&#1072; &#1080;&#1083;&#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;. &#1053;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1091; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1072;&#1076;&#1088;&#1072; &#1089;&#1074;&#1086;&#1081;
&#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;.
&#1063;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1073;&#1083;&#1086;&#1082;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1082;&#1072;&#1076;&#1088;&#1086;&#1084;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1082;&#1072;&#1076;&#1088;&#1086;&#1084; &#1074; &#1089;&#1086;&#1090;&#1099;&#1093; &#1076;&#1086;&#1083;&#1103;&#1093; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;.
</p><p>
&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; GIF &#1092;&#1072;&#1081;&#1083;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; 24-&#1073;&#1080;&#1090;&#1085;&#1099;&#1077; RGB &#1082;&#1072;&#1076;&#1088;&#1099; &#1089; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1077;&#1084; 8-&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1081;
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1086;&#1081;. &#1050;&#1072;&#1076;&#1088;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1078;&#1072;&#1090;&#1099; &#1087;&#1086; LZW &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091;, &#1093;&#1086;&#1090;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
GIF &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1085;&#1077;&#1089;&#1078;&#1072;&#1090;&#1099;&#1077; &#1082;&#1072;&#1076;&#1088;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089; &#1087;&#1072;&#1090;&#1077;&#1085;&#1090;&#1086;&#1084; &#1085;&#1072;
LZW &#1089;&#1078;&#1072;&#1090;&#1080;&#1077;.
</p><p>
&#1045;&#1089;&#1083;&#1080; &#1074; &#1042;&#1072;&#1096;&#1077;&#1084; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1077; &#1085;&#1077;&#1090; <tt>libungif</tt>,
&#1089;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077; &#1082;&#1086;&#1087;&#1080;&#1102; &#1085;&#1072;
<a href="http://prtr-13.ucsc.edu/~badger/software/libungif/index.shtml" target="_top">
&#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; libungif</a>. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1084;. &#1074; 
<a href="http://www.w3.org/Graphics/GIF/spec-gif89a.txt" target="_top">GIF89a
&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1093;</a>.
</p></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="audio-formats"></a>2.1.2. &#1040;&#1091;&#1076;&#1080;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;</h3></div></div><p>
<span class="application">MPlayer</span> - &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;
<span class="bold"><b>&#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074;</b></span>, &#1072; &#1085;&#1077;
<span class="bold"><b>&#1084;&#1077;&#1076;&#1080;&#1072;</b></span> &#1087;&#1083;&#1077;&#1077;&#1088;, &#1093;&#1086;&#1090;&#1103; &#1086;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;
&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1072;&#1091;&#1076;&#1080;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; (&#1086;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;). &#1069;&#1090;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;&#1099;&#1084;
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; <span class="application">MPlayer</span>'&#1072;, &#1042;&#1072;&#1084; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="http://www.xmms.org" target="_top">XMMS</a>.
</p><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="mp3"></a>2.1.2.1. MP3 &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
&#1059; &#1042;&#1072;&#1089; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; MP3 &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
<span class="application">MPlayer</span> &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;, &#1082;&#1072;&#1082; MPEG'&#1080; &#1080;
&#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1080;&#1083;&#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1080;&#1082;&#1072;&#1082;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1073;&#1077;&#1079;
&#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1083;&#1086;&#1093;&#1080;&#1093; MPEG &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1089;&#1105; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1077;&#1089;&#1090;&#1100;
&#1086;&#1073;&#1086;&#1079;&#1088;&#1080;&#1084;&#1086;&#1084; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;. &#1054;&#1087;&#1094;&#1080;&#1103; <tt class="option">-demuxer</tt>, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072; man &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;,
&#1084;&#1086;&#1078;&#1077;&#1090; &#1042;&#1072;&#1084; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="wav"></a>2.1.2.2. WAV &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="ogg-vorbis"></a>2.1.2.3. OGG/OGM &#1092;&#1072;&#1081;&#1083;&#1099; (Vorbis)</h4></div></div><p>
&#1058;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; 
<tt>libogg</tt> &#1080;
<tt>libvorbis</tt>.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="wma-asf"></a>2.1.2.4. WMA/ASF &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p>
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="mp4"></a>2.1.2.5. MP4 &#1092;&#1072;&#1081;&#1083;&#1099;</h4></div></div><p></p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="cdda"></a>2.1.2.6. CD &#1072;&#1091;&#1076;&#1080;&#1086;</h4></div></div><p>
<span class="application">MPlayer</span> &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="application">cdparanoia
</span>(&#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091;) &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; CDDA (Audio CD[&#1040;&#1091;&#1076;&#1080;&#1086; CD]).
&#1042; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1085;&#1077; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;
<span class="application">cdparanoia</span>.
</p><p>
&#1057;&#1084;. &#1085;&#1072; man &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-cdda</tt>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; 
<span class="application">cdparanoia</span>.
</p></div><div class="sect3"><div class="titlepage"><div><h4 class="title"><a name="xmms"></a>2.1.2.7. XMMS</h4></div></div><p>
<span class="application">MPlayer</span> &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
<span class="application">XMMS</span>
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;
&#1084;&#1077;&#1083;&#1086;&#1076;&#1080;&#1081; &#1080;&#1079; SNES &#1080;&#1075;&#1088;, SID &#1084;&#1077;&#1083;&#1086;&#1076;&#1080;&#1081; (&#1080;&#1079; Commodore 64), &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; Amiga &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074;,
.xm, .it, VQF, musepack, Bonk, shorten &#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;. &#1042;&#1089;&#1077; &#1101;&#1090;&#1086; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1086;&#1090;&#1099;&#1089;&#1082;&#1072;&#1090;&#1100; &#1085;&#1072; <a href="http://www.xmms.org/plugins_input.html" target="_top">&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; XMMS &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072;</a>.
</p><p>
&#1044;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; <span class="application">XMMS
</span> &#1080; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="application">MPlayer</span> &#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081;
<tt class="filename">./configure --enable-xmms</tt>. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1042;&#1072;&#1084;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1091;&#1090;&#1080; &#1082; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1077; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;&#1084; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;,
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">--with-xmmsplugindir</tt> &#1080; <tt class="option">
--with-xmmslibdir</tt>.
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="features.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="features.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="codecs.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> 2.2. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1082;&#1086;&#1076;&#1077;&#1082;&#1080;</td></tr></table></div></body></html>
