<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>E.1. GCC 2.96</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="users-vs-dev.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;"><link rel="previous" href="users-vs-dev.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;"><link rel="next" href="mplayer-binary.html" title="E.2. &#1056;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1084;(&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;) &#1074;&#1080;&#1076;&#1077;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">E.1. GCC 2.96</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="users-vs-dev.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</th><td width="20%" align="right"> <a accesskey="n" href="mplayer-binary.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="gcc-296"></a>E.1. GCC 2.96</h2></div></div><p><b>&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1089;&#1099;&#1083;&#1082;&#1080;: </b>
GCC <span class="bold"><b>2.95</b></span> &#1089;&#1077;&#1088;&#1080;&#1081; &#8212; &#1101;&#1090;&#1086; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; GNU &#1088;&#1077;&#1083;&#1080;&#1079; &#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 2.95.3
&#8212; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1072;&#1103; &#1086;&#1090; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1074; &#1101;&#1090;&#1086;&#1081; &#1089;&#1077;&#1088;&#1080;&#1080;. &#1052;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1083;&#1080;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1086;&#1090;&#1085;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072; &#1089;&#1095;&#1105;&#1090; gcc-2.95.3.
&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; RedHat Linux 7.0, <span class="bold"><b>Red Hat</b></span> &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086;
&#1087;&#1088;&#1086;&#1087;&#1072;&#1090;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; CVS &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; GCC &#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1083;&#1080; &#1077;&#1105; <span class="bold"><b>2.96</b></span>.
RedHat &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080; &#1101;&#1090;&#1091; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1074; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; GCC 3.0 &#1085;&#1077; &#1073;&#1099;&#1083;
&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;, &#1072; &#1080;&#1084; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1085;&#1072; &#1074;&#1089;&#1077;&#1093;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1093;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; IA64 &#1080; s390. &#1044;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1100;&#1102;&#1090;&#1086;&#1088; Linux
<span class="bold"><b>Mandrake</b></span>, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1083; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091; Red Hat &#1080; &#1085;&#1072;&#1095;&#1072;&#1083; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080;
GCC 2.96 &#1089; Linux-Mandrake &#1089;&#1077;&#1088;&#1080;&#1080; 8.0.
</p><p><b>&#1047;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;: </b>
&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; GCC &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; GCC 2.96 &#1080; &#1076;&#1072;&#1078;&#1077; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083;&#1072; 
<a href="http://gcc.gnu.org/gcc-2.96.html" target="_top">&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;</a>
&#1085;&#1072; GCC 2.96. &#1059; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091; &#1084;&#1080;&#1088;&#1072; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089;
GCC 2.96, &#1080; &#1086;&#1085;&#1080; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1099;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#8212; &#1101;&#1090;&#1086;
<a href="http://www.mysql.com/downloads/mysql-3.23.html" target="_top">MySQL</a>
&#1080;
<a href="http://avifile.sourceforge.net/news-old1.htm" target="_top">avifile</a>.
&#1055;&#1088;&#1086;&#1095;&#1080;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#8212; &#1101;&#1090;&#1086; 
<a href="http://www.atnf.csiro.au/people/rgooch/linux/docs/kernel-newsflash.html" target="_top">
Linux kernel news flash &#1086; &#1103;&#1076;&#1088;&#1077; 2.4.17</a>
&#1080;
<a href="http://www.voy.com/3516/572.html" target="_top">Voy Forum</a>.
<span class="application">MPlayer</span> &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1090;&#1077;&#1088;&#1087;&#1077;&#1074;&#1072;&#1083; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1084; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; GCC. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080;
&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1099; &#1076;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 2.96, &#1085;&#1086; &#1084;&#1099; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080;&#1089;&#1100; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1093;&#1086;&#1076;&#1099; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1080; &#1073;&#1099;
&#1082; &#1087;&#1086;&#1090;&#1077;&#1088;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;.
</p><p>
GCC 2.96 &#1085;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <tt>|</tt> (pipe[&#1082;&#1072;&#1085;&#1072;&#1083;]) &#1074; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1085;&#1099;&#1093;
&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1093;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; Intel'&#1077;&#1074;&#1089;&#1082;&#1080;&#1081; &#1080; AT&amp;T &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;&#1099;, &#1072;
&#1073;&#1091;&#1082;&#1074;&#1072; <tt>|</tt> &#8212; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1074; Intel'&#1077;&#1074;&#1089;&#1082;&#1086;&#1084; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1077;. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;
&#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085; <span class="emphasis"><i>&#1084;&#1086;&#1083;&#1095;&#1072;</i></span> &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;.
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1101;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086;, GCC &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1072; &#1085;&#1077;
&#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;.
</p><p><b>&#1058;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;: </b>
Red Hat &#1079;&#1072;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;, &#1095;&#1090;&#1086; GCC 2.96-85 &#1080; &#1076;&#1072;&#1083;&#1077;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;. &#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1091;&#1083;&#1091;&#1095;&#1096;&#1080;&#1083;&#1072;&#1089;&#1100;, &#1093;&#1086;&#1090;&#1103; &#1084;&#1099; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1074;&#1080;&#1076;&#1080;&#1084; &#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1080;&#1089;&#1095;&#1077;&#1079;&#1072;&#1102;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1101;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;
&#1074;&#1072;&#1078;&#1085;&#1086;. &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1081; GCC 3.x &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090; &#1101;&#1090;&#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;.
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; 2.96, &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">
--disable-gcc-checking</tt> &#1074; <tt class="filename">configure</tt>. &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086;
&#1042;&#1072;&#1084; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100;, &#1080; <span class="bold"><b>&#1085;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;</b></span>.
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1077;&#1090;&#1077;, &#1042;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1080;&#1079;&#1075;&#1085;&#1072;&#1085;&#1099; &#1080;&#1079; &#1085;&#1072;&#1096;&#1080;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1086;&#1082;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091; &#1085;&#1072;&#1089; &#1091;&#1078;&#1077;
&#1073;&#1099;&#1083;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; '&#1089;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;' &#1080;&#1079;-&#1079;&#1072; GCC 2.96. &#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084; &#1101;&#1090;&#1091; &#1090;&#1077;&#1084;&#1091; &#1074; &#1087;&#1086;&#1082;&#1086;&#1077;.
</p><p>
&#1045;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; GCC 2.96, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; 2.96-85 &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1072;
<a href="ftp://updates.redhat.com" target="_top">ftp &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;</a>RedHat, &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1085;&#1072; 3.0.4 &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1077; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 7.2. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
<a href="ftp://people.redhat.com/jakub/gcc/3.2.3-11/" target="_top">gcc-3.2.3-11 &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;</a>
(&#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;, &#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;) &#1080; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; &#1089; gcc-2.96,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091; &#1042;&#1072;&#1089; &#1089;&#1090;&#1086;&#1080;&#1090;. <span class="application">MPlayer</span> &#1080;&#1093; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090;,
&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; 3.2 &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; 2.96. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1083;&#1080; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;, &#1074;&#1086;&#1090; &#1082;&#1072;&#1082; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; GCC 3 &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;:
</p><div class="procedure"><ol type="1"><li><p>
  &#1055;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;
  <a href="http://gcc.gnu.org/mirrors.html" target="_top">GCC &#1079;&#1077;&#1088;&#1082;&#1072;&#1083;</a>
  &#1080; &#1089;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077; <tt class="filename">gcc-core-<i><tt>XXX</tt></i>.tar.gz</tt>,
  &#1075;&#1076;&#1077; XXX &#8212; &#1101;&#1090;&#1086;
  &#1085;&#1086;&#1084;&#1077;&#1088; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1094;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; C, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;
  &#1076;&#1083;&#1103; <span class="application">MPlayer</span>'&#1072;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; C++, Java &#1080;&#1083;&#1080;
  &#1082;&#1072;&#1082;&#1080;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; GCC, &#1042;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;
  &#1087;&#1086;&#1076;&#1086;&#1081;&#1076;&#1105;&#1090; <tt class="filename">gcc-<i><tt>XXX</tt></i>.tar.gz</tt>.
  </p></li><li><p>
  &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;:
  <pre class="screen">tar -xvzf gcc-core-<i><tt>XXX</tt></i>.tar.gz</pre>
  </p></li><li><p>
  &#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; GCC &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;,
  &#1072; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1074;
  <pre class="screen">mkdir gcc-build</pre>
  </p></li><li><p>
  &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1080;&#1089;&#1090;&#1091;&#1087;&#1080;&#1090;&#1100; &#1082; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; gcc &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1085;&#1086;
  &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;:
  <pre class="screen">
cd gcc-build
../gcc-3.<i><tt>XXX</tt></i>/configure</pre>
  </p></li><li><p>
  &#1057;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; GCC, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1074; &#1101;&#1090;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;:
  <pre class="screen">make bootstrap</pre>
  </p></li><li><p>
  &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; GCC (&#1082;&#1072;&#1082; root), &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1074;
  <pre class="screen">make install</pre>
  </p></li></ol></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="users-vs-dev.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="users-vs-dev.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="mplayer-binary.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> E.2. &#1056;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1084;(&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;) &#1074;&#1080;&#1076;&#1077;</td></tr></table></div></body></html>
