<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>1.1. &#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="intro.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;"><link rel="previous" href="intro.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;"><link rel="next" href="install.html" title="1.2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1.1. &#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="intro.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="install.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="history"></a>1.1. &#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</h2></div></div><blockquote class="blockquote"><p>
This began a year ago...  I have tried lots of players under Linux
(<span class="application">mtv</span>, <span class="application">xmps</span>,
<span class="application">dvdview</span>, <span class="application">livid/oms</span>,
<span class="application">videolan</span>, <span class="application">xine</span>,
<span class="application">xanim</span>, <span class="application">avifile</span>,
<span class="application">xmmp</span>) but they all have some problem. Mostly with
special files or with audio/video sync. Most of them are unable to play both
MPEG1, MPEG2 and AVI (DivX) files. Many players have image quality or speed
problems too. So I've decided to write/modify one...
</p><p>
[&#1069;&#1090;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1082;&#1086;&#1083;&#1086; &#1075;&#1086;&#1076;&#1072; &#1085;&#1072;&#1079;&#1072;&#1076;...
&#1071; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1083; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1083;&#1077;&#1077;&#1088;&#1086;&#1074; &#1087;&#1086;&#1076; Linux (<span class="application">mtv</span>,
<span class="application">xmps</span>, <span class="application">dvdview</span>, <span class="application">
livid/oms</span>, <span class="application">videolan</span>, <span class="application">xine
</span>, <span class="application">xanim</span>, <span class="application">avifile</span>,
<span class="application">xmmp) &#1085;&#1086; &#1091; &#1085;&#1080;&#1093; &#1091; &#1074;&#1089;&#1077;&#1093; &#1073;&#1099;&#1083;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;.</span>
&#1055;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1089;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1072;&#1091;&#1076;&#1080;&#1086;.&#1074;&#1080;&#1076;&#1077;&#1086; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;.
&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; MPEG1, MPEG2, &#1090;&#1072;&#1082; &#1080; AVI
(DivX) &#1092;&#1072;&#1081;&#1083;&#1099;. &#1059; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1087;&#1083;&#1077;&#1077;&#1088;&#1086;&#1074; &#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080;
&#1089;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1103; &#1088;&#1077;&#1096;&#1080;&#1083; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;/&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;...]
</p></blockquote><p>A'rpi, 2001</p><p>
</p><div class="itemizedlist"><ul type="disc"><li><p>
  <span class="bold"><b><span class="application">mpg12play</span> v0.1-v0.3:</b></span> Sep 22-25, 2000
  </p><p>&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1087;&#1086;&#1083;&#1095;&#1072;&#1089;&#1072;!
  &#1044;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.3 &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; libmpeg3 &#1089;
  <a href="http://www.heroinewarrior.com" target="_top">http://www.heroinewarrior.com</a>,
  &#1085;&#1086; &#1090;&#1072;&#1084; &#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;&#1102;.
  </p></li><li><p>
  <span class="bold"><b><span class="application">mpg12play</span> v0.5-v0.87:</b></span> Sep 28-Oct 20, 2000
  </p><p>MPEG &#1082;&#1086;&#1076;&#1077;&#1082; &#1079;&#1072;&#1084;&#1077;&#1085;&#1105;&#1085; &#1085;&#1072; DVDview &#1086;&#1090; Dirk Farin, &#1101;&#1090;&#1086; &#1073;&#1099;&#1083; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081;
  &#1082;&#1086;&#1076;, &#1085;&#1086; &#1086;&#1085; &#1073;&#1099;&#1083; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080; &#1073;&#1099;&#1083; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; C++ (A'rpi &#1085;&#1077;&#1085;&#1072;&#1074;&#1080;&#1076;&#1080;&#1090; C++!!!)
  </p></li><li><p>
  <span class="bold"><b><span class="application">mpg12play</span> v0.9-v0.95pre5:</b></span> Oct 21-Nov 2, 2000
  </p><p>MPEG &#1082;&#1086;&#1076;&#1077;&#1082; &#1073;&#1099;&#1083; libmpeg2 (mpeg2dec) &#1086;&#1090; Aaron Holtzman &#1080;
  Michel Lespinasse. &#1069;&#1090;&#1086; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;
  C &#1082;&#1086;&#1076; &#1089; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;
  &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; 100% &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089; MPEG &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1084;.
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> v0.3-v0.9:</b></span> Nov 18-Dec 4, 2000</p><p>
&#1069;&#1090;&#1086; &#1073;&#1099;&#1083; &#1085;&#1072;&#1073;&#1086;&#1088; &#1076;&#1074;&#1091;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;: mpg12playv0.95pre6 &#1080; &#1084;&#1086;&#1077;&#1075;&#1086; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; AVI
&#1087;&#1083;&#1077;&#1077;&#1088;&#1072; 'avip' &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1085;&#1072; avifile &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082;&#1077; Win32 DLL.
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> v0.10:</b></span> Jan 1, 2001</p><p>
MPEG &#1080; AVI &#1087;&#1083;&#1077;&#1077;&#1088; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1080;&#1082;&#1077;!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> v0.11pre series:</b></span></p><p>
&#1055;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1083;&#1080;&#1089;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1080; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.11 &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; <span class="application">MPlayer</span>
&#1101;&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;! &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; .ASF &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1080; OpenDivX
(&#1089;&#1084;. www.projectmayo.com) &#1082;&#1086;&#1076;&#1077;&#1088;/&#1076;&#1077;&#1082;&#1086;&#1076;&#1077;&#1088;
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> v0.17a "The IdegCounter"</b></span> Apr 27, 2001</p><p>
&#1056;&#1077;&#1083;&#1080;&#1079; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.11pre &#1087;&#1086;&#1089;&#1083;&#1077; 4 &#1084;&#1077;&#1089;&#1103;&#1094;&#1077;&#1074; &#1085;&#1072;&#1087;&#1088;&#1103;&#1078;&#1105;&#1085;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;!
&#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080; &#1080;&#1079;&#1091;&#1084;&#1080;&#1090;&#1077;&#1089;&#1100;! &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1090;&#1099;&#1089;&#1103;&#1095;&#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;... &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;
&#1089;&#1090;&#1072;&#1088;&#1099;&#1081; &#1082;&#1086;&#1076; &#1073;&#1099;&#1083; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;, &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1090;.&#1076;.
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.18 "The BugCounter"</b></span> Jul 9, 2001</p><p>
&#1055;&#1088;&#1086;&#1096;&#1083;&#1086; 2 &#1084;&#1077;&#1089;&#1103;&#1094;&#1072; &#1089;&#1086; &#1074;&#1088;&#1077;&#1084;&#1105;&#1085; 0.17 &#1080; &#1074;&#1086;&#1090; &#1042;&#1072;&#1084; &#1085;&#1086;&#1074;&#1099;&#1081; &#1088;&#1077;&#1083;&#1080;&#1079;.. &#1047;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; ASF,
&#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1089;&#1091;&#1073;&#1090;&#1080;&#1090;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; libao (&#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086; libvo &#1085;&#1086; &#1076;&#1083;&#1103; &#1072;&#1091;&#1076;&#1080;&#1086;),
&#1076;&#1072;&#1078;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1077;&#1085; &#1095;&#1077;&#1084; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;, &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1069;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.50 "The Faszom(C)ounter"</b></span> Oct 8, 2001</p><p>
&#1061;&#1084;&#1084;. &#1057;&#1085;&#1086;&#1074;&#1072; &#1088;&#1077;&#1083;&#1080;&#1079;. &#1058;&#1086;&#1085;&#1085;&#1099; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1073;&#1077;&#1090;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; GUI, &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1085;&#1086;&#1074;&#1099;&#1077; vo &#1080; ao &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;, &#1087;&#1086;&#1088;&#1090;&#1099; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085; DivX
&#1082;&#1086;&#1076;&#1077;&#1082; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1080; &#1084;&#1085;&#1086;&#1075;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;. &#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.60 "The RTFMCounter"</b></span> Jan 3, 2002</p><p>
&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; MOV/VIVO/RM/FLI/NUV &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, "&#1088;&#1086;&#1076;&#1085;&#1099;&#1077;" CRAM, Cinepak,
ADPCM &#1082;&#1086;&#1076;&#1077;&#1082;&#1080;, &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1076;&#1083;&#1103; XAnim'&#1086;&#1074;&#1089;&#1082;&#1080;&#1093; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1074;; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;
DVD &#1089;&#1091;&#1073;&#1090;&#1080;&#1090;&#1088;&#1086;&#1074;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1077;&#1083;&#1080;&#1079; <span class="application">MEncoder</span>, TV &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;, &#1082;&#1101;&#1096;, liba52, &#1073;&#1077;&#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077;
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.90pre10 "The BirthdayCounter"</b></span> Nov 11, 2002</p><p>
&#1061;&#1086;&#1090;&#1103; &#1101;&#1090;&#1086; &#1085;&#1077; &#1088;&#1077;&#1083;&#1080;&#1079;, &#1071; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1089;&#1100; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; 2 &#1075;&#1086;&#1076;&#1072;
&#1087;&#1086;&#1089;&#1083;&#1077; <span class="application">MPlayer</span> v0.01. &#1057; &#1076;&#1085;&#1077;&#1084; &#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; <span class="application">MPlayer</span>!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.90rc1 "The CodecCounter"</b></span> Dec 7, 2002</p><p>
&#1057;&#1085;&#1086;&#1074;&#1072; &#1085;&#1077; &#1088;&#1077;&#1083;&#1080;&#1079;, &#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; Sorenson 3 (QuickTime) &#1080;
Windows Media 9, <span class="application">MPlayer</span> - &#1101;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1074; &#1084;&#1080;&#1088;&#1077; &#1087;&#1083;&#1077;&#1077;&#1088;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1074;&#1089;&#1077;
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.90 "The CounterCounter"</b></span> Apr 6, 2003
  </p><p>&#1055;&#1088;&#1086;&#1096;&#1105;&#1083; &#1075;&#1086;&#1076; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077;, &#1095;&#1077;&#1084; &#1084;&#1099; &#1088;&#1077;&#1096;&#1080;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1076; &#1074;&#1085;&#1086;&#1074;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;
    &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1077;&#1085; &#1080; &#1075;&#1086;&#1090;&#1086;&#1074; &#1082; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1083;&#1080;&#1079;&#1072;. &#1050; &#1085;&#1077;&#1089;&#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1084;&#1099; &#1076;&#1072;&#1078;&#1077; &#1079;&#1072;&#1073;&#1099;&#1083;&#1080;
	&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;, &#1090;&#1091;&#1076;&#1072; &#1087;&#1086;&#1087;&#1072;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1086;&#1089;&#1072;&#1076;&#1085;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086;
	&#1087;&#1088;&#1080;&#1075;&#1086;&#1090;&#1086;&#1074;&#1100;&#1090;&#1077;&#1089;&#1100; &#1082;...
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 0.91</b></span> Aug 13, 2003
  </p><p>&#1042;&#1089;&#1077; &#1074;&#1099;&#1096;&#1077;&#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1077; &#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;.
    &#1069;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;.
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 1.0pre1 "Development on the beach"</b></span> Sep 1, 2003
  </p><p>&#1061;&#1086;&#1090;&#1103; &#1101;&#1090;&#1086; &#1080; &#1085;&#1077; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1083;&#1080;&#1079;, &#1103; &#1093;&#1086;&#1095;&#1091; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091;
    &#1101;&#1090;&#1086; &#8212; &#1087;&#1077;&#1088;&#1074;&#1072;&#1103; &#1087;&#1088;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1089;&#1077;&#1088;&#1080;&#1080; 1.0 <span class="application">MPlayer</span>'&#1072; &#1080; &#1086;&#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;
    <span class="emphasis"><i>&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1087;&#1086; &#1086;&#1090;&#1083;&#1086;&#1074;&#1091; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</i></span>.
    &#1069;&#1090;&#1086; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1081; &#1096;&#1072;&#1075; &#1074;&#1087;&#1077;&#1088;&#1105;&#1076;!
  </p></li><li><p>
  <span class="bold"><b><span class="application">MPlayer</span> 1.0</b></span> &#1076;&#1072;&#1090;&#1072; &#1077;&#1097;&#1105; &#1085;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072;
  </p></li></ul></div><p>
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="intro.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="intro.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="install.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> 1.2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;</td></tr></table></div></body></html>
