<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>E.4. &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;[Joe Barr]</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="users-vs-dev.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;"><link rel="previous" href="nvidia-opinions.html" title="E.3. nVidia"><link rel="next" href="patches.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; F. &#1050;&#1072;&#1082; &#1087;&#1088;&#1080;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1087;&#1072;&#1090;&#1095;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">E.4. &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;[Joe Barr]</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="nvidia-opinions.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</th><td width="20%" align="right"> <a accesskey="n" href="patches.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="joe-barr"></a>E.4. &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;[Joe Barr]</h2></div></div><p>
&#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083; &#1076;&#1091;&#1088;&#1085;&#1091;&#1102; &#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1094;&#1080;&#1102;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1083;&#1072;&#1075;&#1086;&#1089;&#1082;&#1083;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1086;&#1073;&#1079;&#1086;&#1088;&#1072; <span class="application">MPlayer</span>'&#1072;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
<a href="http://www.linuxworld.com/story/32880.htm" target="_top"><span class="application">MPlayer</span>: The project from hell[MPlayer: &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080;&#1079; &#1072;&#1076;&#1072;]</a>.
&#1054;&#1085; &#1089;&#1095;&#1105;&#1083;, &#1095;&#1090;&#1086; <span class="application">MPlayer</span> &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;, &#1080; &#1079;&#1072;&#1103;&#1074;&#1080;&#1083;,
&#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1073;&#1099;&#1083;&#1080; &#1085;&#1077;&#1076;&#1088;&#1091;&#1078;&#1077;&#1083;&#1102;&#1073;&#1085;&#1099;, &#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1087;&#1086;&#1083;&#1085;&#1086;&#1081;
&#1080; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;. &#1042;&#1072;&#1084; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100;. &#1047;&#1072;&#1090;&#1077;&#1084;, &#1086;&#1085; &#1085;&#1077;&#1075;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1083; Arpi &#1074;
<a href="http://www.linuxworld.com/story/32887.htm" target="_top">10 Linux predictions for 2002[10 &#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1081; &#1086; Linux &#1085;&#1072; 2002]</a>.
&#1042; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1073;&#1079;&#1086;&#1088;&#1077; xine, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;
<a href="http://www.linuxworld.com/story/32716.htm" target="_top">A streaming media player for the rest of us[&#1055;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074; &#1076;&#1083;&#1103; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;]</a>
&#1086;&#1085; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1083; &#1088;&#1072;&#1079;&#1076;&#1091;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1086;&#1088;. &#1048;&#1088;&#1086;&#1085;&#1080;&#1095;&#1085;&#1086;, &#1085;&#1086; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1086;&#1085; &#1094;&#1080;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;
&#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1100;&#1102; &#1089; &#1043;&#1102;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1041;&#1072;&#1088;&#1094;&#1093;&#1086;&#1084;[Günter Bartsch], &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1084; <span class="application">xine</span>,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086; &#1087;&#1086;&#1076;&#1099;&#1090;&#1086;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1102;:

</p><blockquote class="blockquote"><p>
However, he also went on to say that he was "surprised" by my column about
<span class="application">Mplayer</span> and thought it was unfair, reminding me that it is
a free software project. "If you don't like it," Bartsch said, "you're free not to use it."
</p><p>
[&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1086;&#1085; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1073;&#1099;&#1083; "&#1091;&#1076;&#1080;&#1074;&#1083;&#1105;&#1085;" &#1084;&#1086;&#1077;&#1081; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1086;&#1081;
&#1086; <span class="application">MPlayer</span>'&#1077; &#1080;
&#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1090;&#1100; &#1084;&#1085;&#1077;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. "&#1045;&#1089;&#1083;&#1080; &#1086;&#1085; &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;", &#1089;&#1082;&#1072;&#1079;&#1072;&#1083; &#1041;&#1072;&#1088;&#1094;&#1093;, "&#1042;&#1099; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;
&#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;."]
</p></blockquote><p>

&#1057;&#1087;&#1091;&#1089;&#1090;&#1103; &#1087;&#1086;&#1095;&#1090;&#1080; &#1076;&#1074;&#1072; &#1075;&#1086;&#1076;&#1072;, &#1074; &#1086;&#1082;&#1090;&#1103;&#1073;&#1088;&#1077; 2003, &#1086;&#1085; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1086;&#1073;&#1079;&#1086;&#1088;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;
Almost two years later in october 2003 he wrote another review called
<a href="http://www.newsforge.com/article.pl?sid=03/10/02/0343200" target="_top">Mplayer revisited[&#1057;&#1085;&#1086;&#1074;&#1072; MPlayer]</a>
(&#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086;).
&#1042; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1072;&#1090;&#1100;&#1077; &#1086;&#1085; &#1087;&#1088;&#1080;&#1096;&#1105;&#1083; &#1082; &#1090;&#1072;&#1082;&#1080;&#1084; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;:

</p><blockquote class="blockquote"><p>
I would have to say that there have been improvements in the number of
features, in performance, and in documentation. It's still not the
easiest install in the world, especially for newbies, but it's a
little better than it used to be.
</p><p>
[&#1071; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1089;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;,
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1072;&#1103; &#1074; &#1084;&#1080;&#1088;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;,
&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1086;&#1074;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086;.]
</p></blockquote><p>

&#1080;

</p><blockquote class="blockquote"><p>
But more importantly, I didn't notice any recent comments about user
abuse. I think I deserve some of the credit for that, even if I do say
so myself. Arpi and the rest of the project team must feel that way
too, because they have taken care to remember me in a special section
of the documentation included in the tarball. Like I said at the
start, some things haven't changed at all.
</p><p>
&#1053;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1103; &#1085;&#1077; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081;
&#1088;&#1091;&#1075;&#1072;&#1085;&#1080;. &#1071; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1103; &#1090;&#1086;&#1078;&#1077; &#1079;&#1072;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1102; &#1087;&#1086;&#1093;&#1074;&#1072;&#1083;&#1091; &#1079;&#1072; &#1101;&#1090;&#1086;, &#1093;&#1086;&#1090;&#1103; &#1084;&#1085;&#1077; &#1080; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;
&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091;. Arpi &#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;, &#1090;&#1086;&#1078;&#1077; &#1090;&#1072;&#1082; &#1076;&#1091;&#1084;&#1072;&#1102;&#1090;,
&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1084;&#1085;&#1077; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1077;&#1082;&#1094;&#1080;&#1102; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085;&#1085;&#1086;&#1081;
&#1074; &#1072;&#1088;&#1093;&#1080;&#1074;. &#1050;&#1072;&#1082; &#1103; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083; &#1074;&#1085;&#1072;&#1095;&#1072;&#1083;&#1077;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1077;&#1097;&#1080; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080;&#1089;&#1100;.
</p></blockquote><p>

&#1052;&#1099; &#1073;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1083;&#1080; &#1083;&#1091;&#1095;&#1096;&#1077; &#1089;&#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082; &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;&#1091;:
"
&#1069;&#1090;&#1086; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1085;&#1077; &#1083;&#1091;&#1095;&#1096;&#1072;&#1103; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1074; &#1084;&#1080;&#1088;&#1077;, &#1085;&#1086; &#1086;&#1085;&#1072; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1099;&#1083;&#1072;.]
[It's still not the fairest or best researched article in the world,
but it's better than it used to be." &#1053;&#1072;&#1076;&#1077;&#1077;&#1084;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;
&#1085;&#1072;&#1096;&#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1091;&#1090;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072; &#1079;&#1088;&#1077;&#1083;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1082; &#1085;&#1072;&#1096;&#1077;&#1084;&#1091; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091;&#1089;&#1103; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1091;, &#1080;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;, &#1091;&#1090;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1102; &#1086;&#1090; &#1086;&#1090; &#1074;&#1086;&#1080;&#1085; &#1092;&#1083;&#1077;&#1081;&#1084;&#1072;.
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="nvidia-opinions.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="users-vs-dev.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="patches.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">E.3. nVidia </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; F. &#1050;&#1072;&#1082; &#1087;&#1088;&#1080;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1087;&#1072;&#1090;&#1095;&#1080;</td></tr></table></div></body></html>
