<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>E.3. nVidia</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="users-vs-dev.html" title="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;"><link rel="previous" href="mplayer-binary.html" title="E.2. &#1056;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1084;(&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;) &#1074;&#1080;&#1076;&#1077;"><link rel="next" href="joe-barr.html" title="E.4. &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;[Joe Barr]"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">E.3. nVidia</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="mplayer-binary.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; E. &#1055;&#1083;&#1072;&#1095; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</th><td width="20%" align="right"> <a accesskey="n" href="joe-barr.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="nvidia-opinions"></a>E.3. nVidia</h2></div></div><p>
&#1053;&#1072;&#1084; &#1085;&#1077; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; <a href="http://www.nvidia.com" target="_top">nVidia</a>
&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1099; (&#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; XFree86), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1102;&#1090; &#1075;&#1083;&#1102;&#1095;&#1085;&#1099;&#1084;&#1080;. &#1059; &#1085;&#1072;&#1089; &#1073;&#1099;&#1083;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; 
<a href="http://mplayerhq.hu/pipermail/mplayer-users/" target="_top">mplayer-users</a>
&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1093;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080; &#1089; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1080;&#1093; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;, &#1085;&#1077;&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080; &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1080; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1089;&#1090;&#1086;&#1074;.
&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1102;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072;. &#1052;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;
&#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089; nVidia, &#1080; &#1086;&#1085;&#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;,
&#1095;&#1090;&#1086; &#1085;&#1077;&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;&#1080; AGP &#1095;&#1080;&#1087;&#1072;&#1084;&#1080;, &#1080; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1085;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1083;&#1080;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1074; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;&#1093; (&#1090;&#1072;&#1082;&#1080;&#1093;, &#1082;&#1072;&#1082; &#1087;&#1091;&#1088;&#1087;&#1091;&#1088;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;). &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080;
&#1091; &#1042;&#1072;&#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089; nVidia &#1082;&#1072;&#1088;&#1090;&#1086;&#1081;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; nVidia
&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;, &#1080;/&#1080;&#1083;&#1080; &#1082;&#1091;&#1087;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1085;&#1089;&#1082;&#1091;&#1102; &#1087;&#1083;&#1072;&#1090;&#1091;, &#1080;&#1083;&#1080; &#1087;&#1086;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; nVidia &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;
&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1081;
nVidia &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1080; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1084;, &#1079;&#1085;&#1072;&#1081;&#1090;&#1077;, &#1095;&#1090;&#1086;
&#1042;&#1099; &#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089; &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1091; &#1085;&#1072;&#1089; &#1087;&#1086;&#1095;&#1090;&#1080;
&#1085;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1042;&#1072;&#1084; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;.
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="mplayer-binary.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="users-vs-dev.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="joe-barr.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">E.2. &#1056;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1084;(&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;) &#1074;&#1080;&#1076;&#1077; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> E.4. &#1044;&#1078;&#1086; &#1041;&#1072;&#1088;&#1088;[Joe Barr]</td></tr></table></div></body></html>
