<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>2.5. TV &#1074;&#1093;&#1086;&#1076;</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="features.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;"><link rel="previous" href="audio.html" title="2.4. Audio output devices"><link rel="next" href="usage.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">2.5. TV &#1074;&#1093;&#1086;&#1076;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="audio.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;</th><td width="20%" align="right"> <a accesskey="n" href="usage.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="tv-input"></a>2.5. TV &#1074;&#1093;&#1086;&#1076;</h2></div></div><p>
&#1042; &#1101;&#1090;&#1086;&#1081; &#1089;&#1077;&#1082;&#1094;&#1080;&#1080; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1072;&#1082; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; <span class="bold"><b>&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;/&#1079;&#1072;&#1093;&#1074;&#1072;&#1090;
&#1089; V4L-&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1075;&#1086; TV &#1090;&#1102;&#1085;&#1077;&#1088;&#1072;</b></span>. &#1057;&#1084;. man &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1076;&#1083;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; TV &#1086;&#1087;&#1094;&#1080;&#1081;
&#1080; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
</p><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="tv-compilation"></a>2.5.1. &#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103;</h3></div></div><div class="procedure"><ol type="1"><li><p>
  &#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="application">MPlayer</span>,
  <tt class="filename">./configure</tt> &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1103;&#1076;&#1088;&#1072;,
  &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; v4l, &#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; <tt class="filename">/dev/video*</tt> &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;.
  &#1045;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; TV (&#1089;&#1084;. &#1074;&#1099;&#1074;&#1086;&#1076;
  <tt class="filename">./configure</tt>).
  </p></li><li><p>
  &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1042;&#1072;&#1096; &#1090;&#1102;&#1085;&#1077;&#1088; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; TV &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086;&#1076; Linux,
  &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <span class="application">XawTV</span>.
  </p></li></ol></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="tv-tips"></a>2.5.2. &#1057;&#1086;&#1074;&#1077;&#1090;&#1099; &#1087;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;</h3></div></div><p>
&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1087;&#1094;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; (man).
&#1042;&#1086;&#1090; &#1074;&#1089;&#1077;&#1075;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074;:
</p><div class="itemizedlist"><ul type="disc"><li><p>
&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">channels</tt>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<pre class="screen">-tv channels=26-MTV1,23-TV2</pre>
&#1054;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077;: &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1086;&#1087;&#1094;&#1080;&#1080;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099; 26
&#1080; 23, &#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1099;&#1081; OSD &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080;,
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1080;&#1081; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;. &#1055;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099; &#1074; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;&#1093; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099;
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; "_".
</p></li><li><p>
&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; 16.
</p></li><li><p>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086; &#1089; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074;&#1099;&#1096;&#1077; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086;
&#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; (&#1090;.&#1077;. 288 &#1076;&#1083;&#1103; PAL &#1080;&#1083;&#1080; 240 &#1076;&#1083;&#1103; NTSC), &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080;
&#1076;&#1077;&#1080;&#1085;&#1090;&#1077;&#1088;&#1083;&#1077;&#1081;&#1089;&#1080;&#1085;&#1075;[deinterlacing]. &#1048;&#1085;&#1072;&#1095;&#1077; &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1092;&#1080;&#1083;&#1100;&#1084; &#1089; &#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074;
&#1089;&#1094;&#1077;&#1085;&#1072;&#1093; &#1089; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1084;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077;
&#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1072;&#1088;&#1090;&#1077;&#1092;&#1072;&#1082;&#1090;&#1099;
&#1086;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1083;&#1077;&#1081;&#1089;&#1080;&#1085;&#1075;&#1072;[interlace] &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1084;&#1077;&#1083;&#1082;&#1080;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;
&#1086;&#1090;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1077;&#1088;&#1072;[bandwidth]. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1076;&#1077;&#1080;&#1085;&#1090;&#1077;&#1088;&#1083;&#1077;&#1081;&#1089;&#1077;&#1088;,
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <tt class="option">-vf pp=DEINT_TYPE</tt>. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; <tt class="option">pp=lb</tt>
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1091;&#1078;&#1077; &#1089;&#1091;&#1073;&#1098;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1084;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1099;
&#1076;&#1077;&#1080;&#1085;&#1090;&#1077;&#1088;&#1083;&#1077;&#1081;&#1089;&#1080;&#1085;&#1075;&#1072; &#1089;&#1084;. &#1085;&#1072; man-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1080; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1080;&#1093;.
</p></li><li><p>
&#1054;&#1073;&#1088;&#1077;&#1078;&#1100;&#1090;&#1077; &#1087;&#1091;&#1089;&#1090;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1095;&#1072;&#1089;&#1090;&#1086;, &#1079;&#1086;&#1085;&#1099; &#1087;&#1086; &#1082;&#1088;&#1072;&#1103;&#1084;
&#1095;&#1077;&#1088;&#1085;&#1099; &#1080;&#1083;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1096;&#1091;&#1084;. &#1069;&#1090;&#1086; &#1086;&#1087;&#1103;&#1090;&#1100; &#1089;&#1098;&#1077;&#1076;&#1072;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1077;&#1088;&#1072;[bandwidth].
&#1058;&#1086;&#1095;&#1085;&#1077;&#1077;, &#1101;&#1090;&#1086; &#1085;&#1077; &#1089;&#1072;&#1084;&#1080; &#1095;&#1105;&#1088;&#1085;&#1099;&#1077; &#1079;&#1086;&#1085;&#1099;, &#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1086;&#1090; &#1095;&#1105;&#1088;&#1085;&#1086;&#1075;&#1086; &#1082; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1089;&#1074;&#1077;&#1090;&#1083;&#1086;&#1084;&#1091; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;. &#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1042;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;,
&#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">crop</tt>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1074;&#1077;&#1089;&#1100; &#1084;&#1091;&#1089;&#1086;&#1088; &#1087;&#1086;
&#1082;&#1088;&#1072;&#1103;&#1084;. &#1057;&#1085;&#1086;&#1074;&#1072;, &#1085;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;&#1080;.
</p></li><li><p>
&#1054;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; CPU. &#1054;&#1085;&#1072; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1090;&#1100; 90% &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072;,
<span class="application">MEncoder</span> &#1087;&#1077;&#1088;&#1077;&#1078;&#1080;&#1074;&#1105;&#1090; &#1090;&#1072;&#1082;&#1091;&#1102;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;, &#1085;&#1086; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;. &#1051;&#1091;&#1095;&#1096;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; 3D
OpenGL  &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077;&#1083;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1080; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1091;&#1102; &#1075;&#1072;&#1076;&#1086;&#1089;&#1090;&#1100;.
</p></li><li><p>
&#1053;&#1077; &#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1099;. <span class="application">MEncoder</span> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1099; &#1076;&#1083;&#1103; A/V &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1090;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1099;
(&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1079;&#1072;&#1076;), <span class="application">MEncoder</span> &#1079;&#1072;&#1087;&#1091;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103;,
&#1080; &#1042;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077; &#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1082;&#1072;&#1076;&#1088;&#1099;. &#1069;&#1090;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;
&#1074;&#1072;&#1078;&#1085;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1082; &#1089;&#1077;&#1090;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;
&#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1074; &#1076;&#1091;&#1093;&#1077; NTP. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; NTP &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072;,
&#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;.
</p></li><li><p>
&#1048;&#1079;&#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <tt class="option">outfmt</tt> &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1042;&#1099;
&#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077;,&#1080;&#1083;&#1080; &#1042;&#1072;&#1096;&#1080; &#1082;&#1072;&#1088;&#1090;&#1072;/&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; (
&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; YV12). &#1042; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; <span class="application">MPlayer</span>/
<span class="application">MEncoder</span> &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;.
&#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1072; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; &#1080; &#1086;&#1087;&#1094;&#1080;&#1103; <tt class="option">outfmt
</tt> &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074; DivX, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;
<tt>libavcodec</tt> &#1080; &#1091;&#1082;&#1072;&#1078;&#1077;&#1090;&#1077;
<tt class="option">outfmt=RGB24</tt> &#1076;&#1083;&#1103; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;
&#1088;&#1072;&#1074;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1074; YV12, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077;, &#1101;&#1090;&#1086; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1072;&#1103;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; CPU.
</p></li><li><p>
&#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; I420 (<tt class="option">outfmt=i420</tt>), &#1042;&#1099;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1087;&#1094;&#1080;&#1102; <tt class="option">-vc rawi420</tt> &#1074; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1086;&#1084; fourcc &#1089;
&#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1084; Intel Indeo.
</p></li><li><p>
&#1045;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1091;&#1090;&#1077;&#1081; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072; &#1072;&#1091;&#1076;&#1080;&#1086;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1079;&#1074;&#1091;&#1082;, &#1083;&#1080;&#1073;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1042;&#1072;&#1096;&#1091;
&#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1091; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1082;&#1072;&#1073;&#1077;&#1083;&#1100;, &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1097;&#1080;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086; &#1082;&#1072;&#1088;&#1090;&#1091; &#1080; &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1099;&#1081; &#1074;&#1093;&#1086;&#1076;[line-in],
&#1083;&#1080;&#1073;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; ADC &#1085;&#1072; &#1074; &#1095;&#1080;&#1087;&#1077; bt878. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; <span class="bold"><b>btaudio</b></span>. &#1063;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;
<tt class="filename">linux/Documentation/sound/btaudio</tt> (&#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1103;&#1076;&#1088;&#1072;, &#1085;&#1077;
<span class="application">MPlayer</span>'&#1072;) &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;.
</p></li><li><p>
&#1045;&#1089;&#1083;&#1080; <span class="application">MEncoder</span> &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1072;&#1091;&#1076;&#1080;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;,
&#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1086;
&#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; arts (KDE) &#1080; esd (GNOME). &#1045;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089;
&#1087;&#1086;&#1083;&#1085;&#1086;&#1076;&#1091;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1072;&#1103; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1072;&#1103; &#1082;&#1072;&#1088;&#1090;&#1072; (&#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1072;&#1088;&#1090;&#1099; &#1101;&#1090;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;),
&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; KDE, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; "full duplex" &#1074; &#1084;&#1077;&#1085;&#1102; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;
&#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.
</p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="tv-examples"></a>2.5.3. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;</h3></div></div><div class="informalexample"><p>
&#1060;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076;, AAlib :)
<pre class="screen">
mplayer -tv driver=dummy:width=640:height=480 -vo aatv://</pre>
</p></div><div class="informalexample"><p>
&#1042;&#1074;&#1086;&#1076; &#1089;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; V4L:
<pre class="screen">
mplayer -tv driver=v4l:width=640:height=480:outfmt=i420 -vc rawi420 -vo xv tv://</pre>
</p></div><div class="informalexample"><p>
&#1041;&#1086;&#1083;&#1077;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;. &#1069;&#1090;&#1086; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; <span class="application">MEncoder</span> &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; PAL
&#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1082;&#1088;&#1072;&#1103; &#1080; &#1076;&#1077;&#1080;&#1085;&#1090;&#1077;&#1088;&#1083;&#1077;&#1081;&#1089;&#1080;&#1090;&#1100; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1091;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;
&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086;&#1075;&#1086; &#1089;&#1084;&#1077;&#1096;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1040;&#1091;&#1076;&#1080;&#1086; &#1089;&#1078;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1075;&#1086; &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072; 64 &#1082;&#1041;/&#1089;,
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; LAME &#1082;&#1086;&#1076;&#1077;&#1082;. &#1069;&#1090;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1090; &#1076;&#1083;&#1103; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072; &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074;.
<pre class="screen">
     mencoder -tv driver=v4l:width=768:height=576 \
     -ovc lavc -lavcopts vcodec=mpeg4:vbitrate=900 \
     -oac mp3lame -lameopts cbr:br=64 \
     -vf crop=720:544:24:16,pp=lb -o <i><tt>output.avi</tt></i> tv://
</pre>
</p></div><div class="informalexample"><p>
&#1047;&#1076;&#1077;&#1089;&#1100;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1076;&#1086; 384x288 &#1080; &#1089;&#1078;&#1072;&#1090;&#1086; &#1089;
&#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084; 350 &#1082;&#1041;/&#1089; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;. &#1054;&#1087;&#1094;&#1080;&#1103; vqmax &#1076;&#1072;&#1105;&#1090; &#1074;&#1086;&#1083;&#1102;
&#1082;&#1074;&#1072;&#1085;&#1090;&#1072;&#1081;&#1079;&#1077;&#1088;&#1091;[quantizer] &#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1089;&#1086;&#1088;&#1091; &#1074;&#1080;&#1076;&#1077;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1095;&#1100; &#1089;&#1090;&#1086;&#1083;&#1100;
&#1085;&#1080;&#1079;&#1082;&#1086;&#1075;&#1086; &#1073;&#1080;&#1090;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072;, &#1087;&#1088;&#1072;&#1074;&#1076;&#1072; &#1094;&#1077;&#1085;&#1086;&#1081; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072;
&#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1093; TV &#1089;&#1077;&#1088;&#1080;&#1081;, &#1075;&#1076;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;.
<pre class="screen">
     mencoder -tv driver=v4l:width=768:height=576 \
     -ovc lavc -lavcopts vcodec=mpeg4:vbitrate=350:vhq:vqmax=31:keyint=300 \
     -oac mp3lame -lameopts cbr:br=48 \
     -vf crop=720:540:24:18,pp=tn/lb,scale=384:288 -sws 1 -o <i><tt>output.avi</tt></i> tv://
</pre>
&#1058;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-tv</tt>
&#1080; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
&#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080; &#1095;&#1091;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074; &#1082; &#1096;&#1091;&#1084;&#1091;.
&#1063;&#1080;&#1087;&#1099; bt8x8 &#1080;&#1079;-&#1079;&#1072; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1089;&#1088;&#1077;&#1076;&#1085;&#1103;&#1090;&#1100; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;
&#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;.
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="audio.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="features.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="usage.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">2.4. Audio output devices </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</td></tr></table></div></body></html>
