<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>5.3. &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; VCD</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="cd-dvd.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 5. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; CD/DVD"><link rel="previous" href="dvd.html" title="5.2. &#1042;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; DVD"><link rel="next" href="ports.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1055;&#1086;&#1088;&#1090;&#1080;&#1085;&#1075;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">5.3. &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; VCD</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="dvd.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 5. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; CD/DVD</th><td width="20%" align="right"> <a accesskey="n" href="ports.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="vcd"></a>5.3. &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; VCD</h2></div></div><p>
&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1086;&#1087;&#1094;&#1080;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074; man. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1076;&#1083;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086;
&#1042;&#1080;&#1076;&#1077;&#1086;-CD (VCD):
<pre class="screen">mplayer vcd://<i><tt>&lt;&#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1072;&gt;</tt></i> [-cdrom-device <i><tt>&lt;&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&gt;</tt></i>]</pre>
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<pre class="screen">mplayer vcd://<i><tt>2</tt></i> -cdrom-device <i><tt>/dev/hdc</tt></i></pre>
&#1059;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; VCD &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#8212; <tt class="filename">/dev/cdrom</tt>. &#1045;&#1089;&#1083;&#1080; &#1042;&#1072;&#1096;&#1080;
&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-cdrom-device</tt>.
</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3><p>
&#1055;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; Plextor'&#1099; &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; Toshiba SCSI CD-ROM &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;
&#1091;&#1078;&#1072;&#1089;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; VCD'&#1086;&#1074;. &#1069;&#1090;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086;
CDROMREADRAW <tt>ioctl</tt> &#1085;&#1072; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1072;&#1093; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1105;&#1085; &#1085;&#1077; &#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084;.
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1074; &#1089;&#1092;&#1077;&#1088;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; SCSI, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;
<a href="../../tech/patches.txt" target="_top">&#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084;</a> &#1074; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;
SCSI generic &#1076;&#1083;&#1103; VCD.
</p></div><p>
&#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; VCD'&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; 
<a href="http://140.132.1.204/OS/Linux/packages/X/viewers/readvcd/" target="_top">
readvcd</a>, &#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1081;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083; <span class="application">MPlayer
</span>'&#1086;&#1084;.
</p><p><b>&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; VCD. </b>
&#1044;&#1080;&#1089;&#1082;&#1080; VCD &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1086;&#1088;&#1086;&#1078;&#1077;&#1082;:
</p><div class="itemizedlist"><ul type="disc"><li><p>
&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1075;&#1072;&#1073;&#1072;&#1081;&#1090; &#1089;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1087;&#1086; 2048 &#1073;&#1072;&#1081;&#1090;&#1086;&#1074;,
&#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; iso9660, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1081; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; VCD &#1076;&#1083;&#1103;
Windows &#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1095;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1074;&#1088;&#1086;&#1076;&#1077; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082; &#1080;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.
</p></li><li><p>
&#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; MPEG-&#1087;&#1086;&#1090;&#1086;&#1082; &#1089;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1087;&#1086; 2324 &#1073;&#1072;&#1081;&#1090;&#1072;, &#1087;&#1086;
&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1087;&#1072;&#1082;&#1077;&#1090;&#1091; MPEG PS &#1085;&#1072; &#1089;&#1077;&#1082;&#1090;&#1086;&#1088; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1050;&#1072;&#1082; &#1080; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080;
&#1072;&#1091;&#1076;&#1080;&#1086;CD, &#1101;&#1090;&#1080; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080; <span class="bold"><b>&#1085;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;</b></span>
(&#1042;&#1099; &#1082;&#1086;&#1075;&#1076;&#1072;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1072;&#1091;&#1076;&#1080;&#1086; &#1076;&#1080;&#1089;&#1082;
&#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1075;&#1086; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080;?) &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1092;&#1080;&#1083;&#1100;&#1084;&#1086;&#1074; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072; &#1101;&#1090;&#1086;&#1081;
&#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1077;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; <tt class="option">vcd://2</tt>.
</p></li><li><p>
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; VCD &#1076;&#1080;&#1089;&#1082;&#1080; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080; (&#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1072; &#1073;&#1077;&#1079; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081;
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;). &#1054;&#1085;&#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1085;&#1086; &#1085;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;.
</p></li></ul></div><p><b>&#1055;&#1088;&#1086; &#1092;&#1072;&#1081;&#1083;&#1099; .DAT. </b>
&#1060;&#1072;&#1081;&#1083; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1074; 600 &#1084;&#1077;&#1075;&#1072;&#1073;&#1072;&#1081;&#1090; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1077; &#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081;! &#1069;&#1090;&#1086; &#1090;&#1072;&#1082;
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; ISO-&#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090;&#1100; Windows &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080;
&#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080; (Windows &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;
&#1082; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;). &#1055;&#1086;&#1076; Linux &#1042;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; (&#1086;&#1085;&#1080; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090;, &#1082;&#1072;&#1082;
&#1084;&#1091;&#1089;&#1086;&#1088;). &#1055;&#1086;&#1076; Windows &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1090;&#1072;&#1084; iso9660 &#1101;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1103;&#1084;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;
&#1082; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1072;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; .DAT &#1092;&#1072;&#1081;&#1083; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1077;&#1085; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;,
&#1080;&#1079; Linux &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; PowerDVD. &#1069;&#1090;&#1086; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;
iso9660 &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (<tt class="filename">vcdfs/isofs-2.4.X.o</tt>), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1101;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1072;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099;
&#1079;&#1072;&#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1076;&#1080;&#1089;&#1082;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1093; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;
.DAT &#1092;&#1072;&#1081;&#1083;&#1099; <span class="application">MPlayer</span>'&#1086;&#1084;. &#1053;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;
&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1084; iso9660 &#1080;&#1079; &#1103;&#1076;&#1088;&#1072; Linux! &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;
<tt class="option">vcd://</tt>. &#1040;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; VCD &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081;
&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; <a href="http://www.elis.rug.ac.be/~ronsse/cdfs/" target="_top">cdfs</a> (&#1085;&#1077;
&#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1103;&#1076;&#1088;&#1086;) &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1076;&#1086;&#1088;&#1086;&#1078;&#1082;&#1080;[&#1089;&#1077;&#1089;&#1089;&#1080;&#1080;] &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1082;&#1072;&#1082; &#1092;&#1072;&#1081;&#1083;&#1099;
&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074; &#1080; <a href="http://cdrdao.sf.net/" target="_top">cdrdao</a>, &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103;
&#1087;&#1086;&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;/&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; CD.
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="dvd.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="cd-dvd.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="ports.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">5.2. &#1042;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; DVD </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1055;&#1086;&#1088;&#1090;&#1080;&#1085;&#1075;</td></tr></table></div></body></html>
