<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>6.6. Windows</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.49"><link rel="home" href="index.html" title="MPlayer - The Movie Player"><link rel="up" href="ports.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1055;&#1086;&#1088;&#1090;&#1080;&#1085;&#1075;"><link rel="previous" href="qnx.html" title="6.5. QNX"><link rel="next" href="macos.html" title="6.7. Mac OS"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">6.6. Windows</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="qnx.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1055;&#1086;&#1088;&#1090;&#1080;&#1085;&#1075;</th><td width="20%" align="right"> <a accesskey="n" href="macos.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="windows"></a>6.6. Windows</h2></div></div><p>&#1044;&#1072;, <span class="application">MPlayer</span> &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076; Windows &#1087;&#1086;&#1076;
  <a href="http://www.cygwin.com/" target="_top"><span class="application">Cygwin</span></a> &#1080;
  <a href="http://www.mingw.org/" target="_top"><span class="application">MinGW</span></a>.
  &#1055;&#1086;&#1082;&#1072; &#1077;&#1097;&#1105; &#1085;&#1077;&#1090; GUI, &#1085;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072;. &#1052;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;
  &#1073;&#1091;&#1076;&#1077;&#1084; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1099; &#1079;&#1072; <a href="../../tech/patches.txt" target="_top">&#1087;&#1072;&#1090;&#1095;&#1080;</a>.
  &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1085;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077;
  <a href="http://mplayerhq.hu/mailman/listinfo/mplayer-cygwin/" target="_top">mplayer-cygwin</a>.</p><p>&#1051;&#1091;&#1095;&#1096;&#1080;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; DirectX &#1074;&#1080;&#1076;&#1077;&#1086;
  &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; (<tt class="option">-vo directx</tt>) &#1080; &#1088;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; Windows waveout &#1072;&#1091;&#1076;&#1080;&#1086; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;
  (<tt class="option">-ao win32</tt>). &#1040;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; OpenGL &#1080;&#1083;&#1080;
  SDL, &#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; OpenGL &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1084;&#1072;&#1096;&#1080;&#1085;&#1099;, &#1072; SDL &#1085;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
  &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1080;&#1089;&#1082;&#1072;&#1078;&#1072;&#1077;&#1090; &#1079;&#1074;&#1091;&#1082; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080;&#1083;&#1080; &#1083;&#1086;&#1084;&#1072;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;. 
  &#1045;&#1089;&#1083;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1086;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077; &#1091;&#1089;&#1082;&#1086;&#1088;&#1077;&#1085;&#1080;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074;
  <tt class="option">-vo directx:noaccel</tt>. &#1057;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077;
  <a href="http://www.videolan.org/vlc/dx7headers.tgz" target="_top">&#1092;&#1072;&#1081;&#1083;&#1099; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074;
  DirectX 7</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; DirectX.</p><p><a href="video.html#vidix" title="2.3.2.13. VIDIX">VIDIX</a> &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1079;-&#1087;&#1086;&#1076; Windows, &#1082;&#1072;&#1082;
  <tt class="option">-vo winvidix</tt>, &#1093;&#1086;&#1090;&#1103; &#1101;&#1090;&#1086; &#1077;&#1097;&#1105; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081;
	&#1088;&#1091;&#1095;&#1085;&#1086;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;. &#1057;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077;
  <a href="http://www.mplayerhq.hu/MPlayer/releases/win32-beta/dhahelper.sys" target="_top">dhahelper.sys</a>
  &#1080; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;
  <tt class="filename">libdha/dhahelperwin</tt> &#1074; &#1042;&#1072;&#1096;&#1077;&#1084; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077;
	&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; <span class="application">MPlayer</span>'&#1072;.
	&#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; &#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1101;&#1090;&#1086;&#1090; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;

  <pre class="screen">gcc -o dhasetup.exe dhasetup.c</pre>

  &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077;

  <pre class="screen">dhasetup.exe install</pre>

  &#1087;&#1086;&#1076; &#1040;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;[Administrator]. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1084;&#1072;&#1096;&#1080;&#1085;&#1091;.
  &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1105; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1086;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;
  <tt>.so</tt> &#1080;&#1079; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;
	<tt class="filename">vidix/drivers</tt> &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;
	<tt class="filename">mplayer/vidix</tt> &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086;
	<tt class="filename">mplayer.exe</tt>.</p><p>&#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1080;&#1083;&#1091;&#1095;&#1096;&#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;, <span class="application">MPlayer</span>
  &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;, &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1042;&#1072;&#1096;&#1077;&#1081;
  &#1074;&#1080;&#1076;&#1077;&#1086;&#1082;&#1072;&#1088;&#1090;&#1086;&#1081;. &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1099; &#1087;&#1086;&#1076; Windows &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086;
  &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;.
  &#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1081;&#1090;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077;

  <pre class="screen">mplayer -benchmark -nosound -frames 100 -vf format=<i><tt>colorspace</tt></i> <i><tt>movie</tt></i></pre>,

  &#1075;&#1076;&#1077; <i><tt>colorspace</tt></i> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084;
  &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1080;&#1079; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-vf format=fmt=help</tt>. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077;
  &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1042;&#1072;&#1096;&#1072; &#1082;&#1072;&#1088;&#1090;&#1072; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1083;&#1086;&#1093;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;,
  &#1086;&#1087;&#1094;&#1080;&#1103; <tt class="option">-vf noformat=<i><tt>colorspace</tt></i></tt>
  &#1087;&#1086;&#1084;&#1077;&#1096;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1101;&#1090;&#1086; &#1074; &#1074;&#1072;&#1096; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1095;&#1090;&#1086;&#1073;&#1099;
  &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100;.</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Win32 &#1082;&#1086;&#1076;&#1077;&#1082;&#1080; &#1080; Real Win32 &#1082;&#1086;&#1076;&#1077;&#1082;&#1080; (&#1085;&#1077; Real Linux &#1082;&#1086;&#1076;&#1077;&#1082;&#1080;),
  &#1077;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;. &#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1080;&#1093; &#1082;&#1091;&#1076;&#1072;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1074; &#1087;&#1091;&#1090;&#1080; &#1080;&#1083;&#1080; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077;
  <tt class="filename">configure</tt> &#1086;&#1087;&#1094;&#1080;&#1102;
  <tt class="option">--with-codecsdir=<i><tt>c:/path/to/your/codecs</tt></i></tt>
  (&#1080;&#1083;&#1080; <tt class="option">--with-codecsdir=<i><tt>/path/to/your/codecs</tt></i></tt>, &#1085;&#1086;
  &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076; <span class="application">Cygwin</span>). &#1059; &#1085;&#1072;&#1089; &#1073;&#1099;&#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086; &#1090;&#1086;&#1084;,
  &#1095;&#1090;&#1086; Real DLL'&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091;
  <span class="application">MPlayer</span>, &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;
  &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1085;&#1080;&#1084;&#1080;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080;&#1093;
  &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080;. QuickTime DLL'&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;, &#1085;&#1086; &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093;
  &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; Windows &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;
  (<tt class="filename"><i><tt>C:\Windows\system\</tt></i></tt>
  &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1076;&#1091;&#1093;&#1077;). &#1042; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074; &#1090;&#1086;&#1090;&#1078;&#1077;
  &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1095;&#1090;&#1086; &#1080; <span class="application">MPlayer</span>.</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; VCD, &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1103; <tt class="filename">.DAT</tt>
  &#1080;&#1083;&#1080; <tt class="filename">.MPG</tt> &#1092;&#1072;&#1081;&#1083;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; Windows &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; VCD.
  &#1042;&#1086;&#1090; &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; (&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077; &#1073;&#1091;&#1082;&#1074;&#1091; &#1076;&#1080;&#1089;&#1082;&#1072; &#1042;&#1072;&#1096;&#1077;&#1075;&#1086; CD-ROM):</p><pre class="screen">mplayer <i><tt>d:/mpegav/avseq01.dat</tt></i></pre><p>DVDs &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;, &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; <tt class="option">-dvd-device</tt> &#1089; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081;
  &#1042;&#1072;&#1096;&#1077;&#1075;&#1086; DVD-ROM:</p><pre class="screen">mplayer dvd://<i><tt>&lt;title&gt;</tt></i> -dvd-device <i><tt>d</tt></i>:</pre><p>&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; <span class="application">Cygwin</span>/<span class="application">MinGW</span>
  &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103;. &#1055;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1080;&#1083;&#1080;
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080; <tt class="option">-quiet</tt> &#1091;&#1083;&#1091;&#1095;&#1096;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072;
  &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;. &#1055;&#1088;&#1103;&#1084;&#1086;&#1077; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;[Direct rendering] (<tt class="option">-dr
  </tt>) &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1084;&#1077;&#1088;&#1094;&#1072;&#1085;&#1080;&#1103; OSD, &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1074;
  &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; <tt class="option">-double</tt> &#1076;&#1074;&#1086;&#1081;&#1085;&#1091;&#1102; &#1073;&#1091;&#1092;&#1077;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;
  &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1080;&#1089;&#1090;&#1086;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; <tt class="option">-autosync 100</tt>. &#1045;&#1089;&#1083;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093;
  &#1086;&#1087;&#1094;&#1080;&#1081; &#1042;&#1072;&#1084; &#1087;&#1086;&#1084;&#1086;&#1075;&#1091;&#1090;, &#1089;&#1090;&#1086;&#1080;&#1090; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.</p><p>&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1057;&#1072;&#1096;&#1072; &#1047;&#1086;&#1084;&#1084;&#1077;&#1088; [Sascha Sommer] &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1086;&#1092;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1080;&#1085;&#1072;&#1088;&#1080;&#1080;
  &#1087;&#1086;&#1076; Windows, &#1044;&#1078;&#1086;&#1081; &#1055;&#1101;&#1088;&#1088;&#1080;&#1096;[Joey Parrish] &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;
  &#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; Windows &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1084;. &#1048;&#1097;&#1097;&#1080;&#1090;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074; &#1089;&#1077;&#1082;&#1094;&#1080;&#1080;
  Windows <a href="http://www.mplayerhq.hu/homepage/projects.html#windows" target="_top">
  &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;</a>.</p><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="cygwin"></a>6.6.1. <span class="application">Cygwin</span></h3></div></div><p><span class="application">Cygwin</span> &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1076;&#1086; 1.5.0 &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1083;
  <tt class="filename">inttypes.h</tt>. &#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090;
  <a href="http://www.mplayerhq.hu/MPlayer/releases/win32-beta/contrib/inttypes.h" target="_top">inttypes.h</a>
  &#1074; <tt class="filename">/usr/include/</tt>, &#1095;&#1090;&#1086;&#1073;&#1099;
  <span class="application">MPlayer</span> &#1084;&#1086;&#1075; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;.</p><p>&#1060;&#1072;&#1081;&#1083;&#1099; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; DirectX &#1085;&#1072;&#1076;&#1086; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; <tt class="filename">
  /usr/include/</tt> &#1080;&#1083;&#1080; <tt class="filename">/usr/local/include/
  </tt>.</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; SDL
  &#1087;&#1086;&#1076; <span class="application">Cygwin</span> &#1085;&#1072;
  <a href="http://www.libsdl.org/extras/win32/cygwin/" target="_top">&#1089;&#1072;&#1081;&#1090;&#1077; libsdl</a>.</p></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="mingw"></a>6.6.2. <span class="application">MinGW</span></h3></div></div><p>&#1055;&#1088;&#1077;&#1078;&#1076;&#1077;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; <span class="application">MinGW</span>,
  &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1081; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="application">MPlayer</span>, &#1073;&#1099;&#1083;&#1072;
  &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081;, &#1085;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1074;&#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077;
  <span class="application">MinGW</span> 3.1.0 &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1080; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077;
  MSYS &#1087;&#1086;&#1089;&#1090;&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1097;&#1080;&#1082;&#1091;, &#1095;&#1090;&#1086; <span class="application">MinGW</span>
  &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;.</p><p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1085;&#1085;&#1102;&#1102;, &#1095;&#1077;&#1084; 3.1.0 &#1074;&#1077;&#1088;&#1089;&#1080;&#1102;
  <span class="application">MinGW</span>, &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;
  &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; <tt class="filename">/mingw/include/sys/types.h</tt> &#1101;&#1090;&#1080;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084;:
  <a href="http://www.mplayerhq.hu/MPlayer/releases/win32-beta/contrib/types.h" target="_top"><tt class="filename">types.h</tt></a>.</p><p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; DirectX &#1074; <tt class="filename">/mingw/include/</tt>.</p><p>&#1044;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1089;&#1078;&#1072;&#1090;&#1099;&#1093; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1072;&#1074; MOV &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072;
  <a href="http://www.gzip.org/zlib/" target="_top">zlib</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102;
  <span class="application">MinGW</span> &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;.
  &#1057;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1105;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; <tt class="option">--prefix=/mingw</tt> &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077;
  &#1077;&#1105; &#1076;&#1086; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; <span class="application">MPlayer</span>'&#1072;.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="qnx.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="ports.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right"> <a accesskey="n" href="macos.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">6.5. QNX </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> 6.7. Mac OS</td></tr></table></div></body></html>
